{"version": 1, "title": "Confusion Matrix", "labels": ["negative", "positive"], "matrix": [[53, 50], [16, 81]], "rowLabel": "Actual Category", "columnLabel": "Predicted Category", "maxSamplesPerCell": 25, "sampleMatrix": [[[{"index": 131, "sample": "I went to the cinema slightly apprehensive, I came out seething with anger at the garbage (passing for a film)I had witnessed. The actors, particularly Travolta, should be ashamed of themselves for their participation in this. Clearly the only thing in their minds was the pay cheque, never mind the debasement of their talents and us . Travolta needs to go back to doing some more \"Look who's Talking\" movies as he has sunk back to the level of his pre-Tarantino work. It comes to something when the L W Talking sequels are better than this one. Travolta is no longer the King of Cool but the King of Corn. Michael Caine himself admitted to doing bad movies for the pay cheque, Trvolta should follow suit if he has any self respect !", "assetId": null}, {"index": 132, "sample": "This episode sucks.<br /><br />Over the past few years I have watched all episodes of \"Next Generation\" and \"Voyager\" and am now watching \"Enterprise\".<br /><br />I am thoroughly enjoying this series. Until this episode. I stared at the screen in horror at the destruction of character and entertainment. It is more like an attempt at slapstick.<br /><br />It does not build the characters but throws them out on a limb - and leaves the audience gasping. It does little to build the series.<br /><br />Why this was ever allowed to go to air amazes me. Was it the writing? Was it the directing? Was it the producer? We'll probably never know.<br /><br />But one bad apple isn't bad I suppose. I say that hoping it is only one.", "assetId": null}, {"index": 4, "sample": "I would be one of the few people who owns a copy of this classic. But i dont only own 1, i actually own 2. Its THAT good.<br /><br />Well, when i say good, i mean bad. But i will try to do a thorough review. I even watched 'born a ninja' which one of the other reviewers here mentioned, to compare it to this. And born a ninja is actually worse, but not quite as funny.<br /><br />And is this ever funny. EVERYTHING about this movie is poor. EVERYTHING. The plot is absolutely stuffed (note the 'you'll need to keep me alive if you want to know where to find your wife'). EVERY action sequence is stuffed too. Our hero danton is more than a hero; he can stab people with twigs, take 3 bullets in the heart at 50 cm away without even bleeding, and tie a rope up to a tree which, when an enemy steps on it, ties a knot around the enemies leg, picks him up, and throws him 50 metres into a bunch of spikes.<br /><br />The acting is so bad it is impossible to comment on it, but it should have you rolling, especially dantons 'jump out of the ground and growl at the bad guy'. Oh yes, and the bad guys: somehow, it seems they resurrect themselves 5 times each in the movie. Perhaps it's just that there weren't enough actors, but in a movie of this calibre? i doubt that.<br /><br />The 'plot' is about how danton was a soldier in the vietnam war, and now his colonel is hunting real people for training for his mercenaries. The colonel just happens to pick up danton, then danton fights back. This is just the excuse for a rambo clone, with most of the movie being danton slaughtering soldiers. And i really cant explain the plot any more cos there is nothing else to the movie. It still rocks though.<br /><br />What else could be wrong you ask? Dont get me started. Hand grenades which actually go off at the actors' feet because the explosion is the size of a match.Scenes where there are 5 people chasing danton, then the camera cuts away and back and there are 7. The way that every time danton loads the grenade launcher he is against the same background even though he is in completely diffrent locations. And the worst part is when danton pushes the plastic boulders onto the enemies, and one enemy is completely untouched by the boulders, so he doesn't know what to do so he half heartedly dies without even being touched. It's ridiculous!!!<br /><br />But funny. Very, VERY funny. This is one of the few movies i can thoroughly recommend to everybody, cos if you dont find it funny, you are 1 in a million. And for the rest of us it's magic.", "assetId": null}, {"index": 11, "sample": "I really tried to like this film about a doctor who has the possibility of a new life with a young woman if he can comes to terms with the death of his wife. I suppose this was to play like a quirky light romantic comedy but the theme is a little uncomfortable for me.<br /><br />But putting that aside, I found the dialog was too much like a stage play despite being based on a novel and also,the mediocre acting was embarrassing to watch especially by the young lead Vincent Spano.<br /><br />I have been sort of trying to catch up on all the eighties movies I missed during that decade. It has been my pet peeve that eighties nostalgia buffs seem to focus on the same core canon of films usually featuring the brat pack actors and actresses and neglecting the other films like Creator that have fallen through the cracks. But in the case of this feature I have to say I can understand it. Not all of these eighties films were magical and Creator is proof of this.", "assetId": null}, {"index": 16, "sample": "The worst movie ever made. If anyone asks you what is the worst movie you've ever seen - tell them Plump Fiction. Of all the movies I've ever seen this gotta be the most lame experience. Even the poorest sequels are pure masterpieces compared", "assetId": null}, {"index": 151, "sample": "Afraid of the Dark left me with the impression that several different screenplays were written, all too short for a feature length film, then spliced together clumsily into this Frankenstein's monster.<br /><br />At his best, the protagonist, Lucas, is creepy. As hard as it is to draw a bead on the secondary characters, they're far more sympathetic.<br /><br />Afraid of the Dark could have achieved mediocrity had it taken just one approach and seen it through -- and had it made Lucas simply psychotic and confused instead of ghoulish and off-putting. I wanted to see him packed off into an asylum so the rest of the characters could have a normal life.", "assetId": null}, {"index": 165, "sample": "This movie is a bad movie. But after watching an endless series of bad horror movies, I can say that it is a little different from many I have seen. Not in the plot, which is a fairly regular slasher story, but more the way the scenes are cut. Murder Weapon gives us a lot of inane dialogue scenes, but they go on for a lot longer than in most movies of this type. Because of this some of the victims seem slightly less like cardboard cut-outs. Just slightly. I had a difficult time figuring out exactly what was happening at the beginning and kept wondering if certain events were dream sequences. My favorite scene is when two guys are on the run from the killer and take refuge in a car. In the glove compartment, they find a handgun. \"Thank you, God!\" one of them happily exclaims. That guy's head suddenly looks like a mannequin's head, and it went on for just enough time for me to wonder, \"What is that? Where is that mannequin in relation to the two guys in the car?\" Then BOOM! The head explodes and I figured out that it was supposed to be one of the guys in the car getting his head shot off with a shotgun. I love that scene, but the movie is a very bad movie. 3/10.", "assetId": null}, {"index": 166, "sample": "Cultural Vandalism Is the new Hallmark production of Gulliver's Travels an act of cultural vandalism? Not literally. After all, not a single copy of the book is burned. But if this is the only Gulliver people are exposed to\u0097and to many it will be\u0097those people will not get anything like what Jonathan Swift intended. Were Jonathan Swift alive, Hallmark could be sued for moral rights violations and they'd lose. That's a good way to think before starting a project using someone else's ideas.<br /><br />Swift's masterpiece is an extraordinary vision of humanity. Through his hero, Gulliver, he travels to places that make him feel big, small, shat on and\u0085 human. The little people in Lilleput are small in every way. Petty and stupid, they fight, the big-enders and little- enders, interminable wars of annihilation over which end of their soft-boiled eggs are opened at the breakfast table. Sounds a bit like us.<br /><br />I forget most of the rest: it's been years since I read it. The TV show reminded me of a few things and, on the bright side, it made me want to read it again.<br /><br />This gift to mankind has been shat on, like Gulligan under the boughs beneath the vulgar yahoos, and Danson, Steenbergen and especially two great actors, Peter O'Toole and Edward Fox, ought to be thoroughly ashamed. Some \"Creative Person\" got the bright idea to put the focus on \"the star:\" Gulliver, played by Ted Danson, whose acting is just plain bad. He portrays Gulliver as insane. All his travels were made up. Weeeeel. Yeeeaaah! Of course Swift made up Gulliver! Naturally, the lands he visited were imaginary: that's called fiction. His purpose was to talk about humankind and our, often awful, relations with each other. The travels of his imaginary character to imaginary lands is his method. But these people treat imagination as a disease and anyone who has a moment that Hallmark couldn't turn into one of its anodyne cards is suspect.<br /><br />I can sure see why Hallmark would produce this crap. It's so bad that O'Toole, always profound, seems as little as his Lilliputian character. He's in character, of course, while commenting on the character simultaneously, as many, if not all great actors do. Informing the character sheds light on it. Our light completes the character. It becomes three dimensional through this act of psychic triangulation. Most actors do this very subtly, like Hopkins in \"The Remains of the Day.\" Others, like Nicholson, in most things in the last twenty years, play the two parts pretty broadly apart. Nicholson actually plays on the relationship of his two points and with us too: with him it's all cat's cradle and he, chuckling away, holds all the strings. Great fun, as is O'Toole. But something here is lacking. He is shouting into a megaphone (as great as ever) and all one senses is a hollow shell standing under him.<br /><br />That's because it is. Look up \"anodyne\" and there ought to be the word \"Hallmark\" as a synonym. Harmless, bland, inoffensive: Hallmark is the doll who can't pee because she has no genitals: it is the norm, the average, the person of no distinction. Hallmark's hallmark is to have no hallmark. I never suspected that such people despise those who have imagination quite so much. Suddenly, Pound's \"Disney against the meta-physicals\" stands out in bold type. Or Einstein's \"Men of genius always will be violently opposed by mediocre minds.\" Indeed, anyone, to this mediocre type, who has an answer to any question other than \"a)\" or \"b)\" is suspect. Who more distinctive then that a man who journeys to the darker places of the human soul and shines his little flashlight to illuminate what can be found there? Hence the act of vandalism. The Taliban destroyed the Buddhas in Afghanistan, the Palestinians the oldest synagogue in the world at Jericho, the barbarians the great statuary of the Classical age and these things are obviously vandalism. Hallmark endeavors to protect us from foreign foes by undermining our own culture; the one that feeds and sustains them. And us.<br /><br />Please buy a copy of Gulliver's Travels wherever you live, and read it. Or order it online. I like to use ABE Books.", "assetId": null}, {"index": 39, "sample": "I give it a 2 - I reserve a 1 rating for Guy Ritchie and Woody Allen films. We don't even remember what this movie was about. The only thing we recall is one gunshot scene where the actors drop to the ground, roll to the other side of a hallway or something and then get back up shooting. It was like watching 80-year-olds with 2 broken legs trying to perform the 'stunts'. Also, when the characters were driving in a truck, the engine noise (or radio? can't recall) would vanish entirely when the actors were talking.<br /><br />And, like others, we bought it because of the Sandra Bullock front cover. very sad, very bad.", "assetId": null}, {"index": 169, "sample": "This movie is proof you can't just go to a Redbox and read descriptions of films and pick one and give it a try.<br /><br />While I'll give 'em great credit for having produced a film with halfway-decent special effects on such a low budget, and at least a halfway decent script and story line... unfortunately, it was only just that: halfway decent.<br /><br />If you like movies where things aren't all neatly wrapped up, and don't mind low-budget effects, you might like this film. Honestly, it wasn't really my cup of tea. I should've just gone to bed rather than spend my time watching.<br /><br />For a better science-fiction movie produced on an even LOWER budget (!) have a look at \"Primer.\"", "assetId": null}, {"index": 173, "sample": "Personally, I didn't really gain a whole lot from THE ACT OF SEEING WITH ONE'S OWN EYES. I've noticed a lot of really highly rated reviews on here for the film, and I'm kinda surprised. Maybe I missed something that other reviewers felt \"moved\" by but I found the film pretty tedious and basically pointless.<br /><br />The \"action\" of the film is a bunch of autopsy footage that is filmed in an \"art-house\" style - lots of extreme close-ups, weird editing, etc...and with no sound or dialogue.<br /><br />I guess THE ACT OF SEEING WITH ONE'S OWN EYES could be considered a study of human anatomy, or maybe (if you really wanna dig a little) some sort of comment on the fragility of humanity or whatever - but I personally found it to be a bunch of semi-interesting but ultimately dull autopsy footage. If that's your thing, then this will be a winner for you. As for me - I've seen more interesting ER footage. Not a \"bad\" film, as it isn't really a \"film\" in any traditional sense - I just found nothing really notable about it - 4/10.", "assetId": null}, {"index": 52, "sample": "When I think Bollywood. I think of lite feel good musical dance numbers, with gorgeous outfits on the men and women. And catchy tunes. Horror, Thrillers, Mystery and Suspense, don't come to mind though. And this, to my Western eyes, is like an abstract comedy. <br /><br />I think it would have been a better movie, shorter even, if the writer and the director had made a definite choice. Either gone for outright Thriller-Horror, Comedy-Mystery, Supernatural-Suspense or Musical-Romance, instead of an awkward mixture of them all. <br /><br />I'll have to say more than once I thought the director must have seen \"I Know What You Did Last Summer\" and tried to give it a Bollywood twist. My first film was Bride & Prejudice. Which I thought was acted well. <br /><br />This seemed like what a Western Audience would consider a straight to video cheese fest.<br /><br />The acting was over the top, at times it felt like they were intentionally trying to parody western thrillers, but when you saw them try to inject the dramatic crying, screaming or fear, it felt out of place. <br /><br />The viewer was left wondering when one of the actors would wink at the camera. More than a few times when the audience was supposed to be horrified, we could only snicker a the absurdity. <br /><br />I watch a lot of foreign films, and even though I don't know Hindi, I have to say they did a poor job subtitling the film. Sometimes it was difficult to read the white lettering against the bright background. <br /><br />The villain was particularly amusing, at least to me, because he came with his own mood music. The supposed surprising twist, actually felt like a cop out.<br /><br />The lead couples were handsome/pretty enough, and the musical numbers made it worth my rental fee. I'd suggest it to someone as a musical- comedy, but I'd tell them to just fast forward the rest of the movie, because it wasn't worth the effort of reading. If you're determined to read a whole subtitled Hindi flick, then check out the superior Romantic Drama 'Namasteay, London'. <br /><br />But I was not scared..unless that's really what they think is horrifying in India. 1 out of 10 for what it's being touted as. 6 out of 10 for it's unintentional quickness & ability to illicit lots of laughs, and it's musical/dance numbers. Enjoy :)", "assetId": null}, {"index": 53, "sample": "Witchy Hildegard Knef traps a group of people in an isolated hotel and picks them off one by one in twisted, disgusting ways. I thought I'd seen it all until one unfortunate man here is crucified and then has his head set on fire. Hildy is quite the prankster too: she takes a nagging harpy and sews her mouth shut...then hangs her upside down in the chimney just in time for a roaring fire! \"Witchery\" made me sick. It made my eyes hurt. I was ready to write it off as the worst movie ever-ever-ever made by otherwise competent people...until the finale. I have to admit I loved the ending. It involves a boy and his toy tape-recorder cornered by Linda Blair looking fantastically possessed. The scene only lasts for about a minute and the movie's over, but you know that old saying: \"If you've got a great ending, people will forgive you for just about anything!\"", "assetId": null}, {"index": 188, "sample": "Ewe, The opening screams zero budget. The titles whooshing in look like my grandson was let loose with iMovie. The DVD box gives the impression that you'll be treated to the old days of '80s boobie movies. NOPE! Hardly any nudity from a flick that stars Traci Lords! This movie really did need the nudity too. Instead you get a lot of Lords perkies pointing through a shirt, however they seem to be activated by hot steam. That's odd, in my world the headlights go on in the COLD.<br /><br />The plot is pathetic, the blind guy is just is a joke, and not a funny one. His antics are so forced and predictable. He trips over stuff and you see him bracing for the fall. He needs to work on his physical comedy.<br /><br />Most of Frostbite's nudity comes from a hot tub scene that looks like it was shot months later and inserted in to get a distributor. And the nudity is not worth it.<br /><br />NamoiBucks; it's just a matter of time before Starbucks sues over that. Not even funny. As Billy arrives in town for the first time they come across Namoi Bucks, He comments \"Wow they have these everywhere.\" This leads you to believe it's a parody on Starbucks, but surprise, behind the counter of this location is Namoi herself. Apparently she loves coffee so much that the owner of this huge chain decided to work in a tiny cold town.<br /><br />The only thing this movie has going for it is the Warren Miller snowboarding footage. Yep this is all Warren's stuff, so if you want to see great action, get a Warren miller flick. Leave Frostbite alone.<br /><br />There is nothing good about this movie. There is no reason to rent it or buy it, and if a friend offers to loan you a copy for free. Hit him and end the friendship.", "assetId": null}, {"index": 189, "sample": "Sometimes I wonder if today's horror movies rely on human torturing to make people scared. If so, then there's a sad future for horror movies. Dee Snyder tries to make you feel scared and terrified, this movie does exactly this but not in a good way. Now there are some moments in the film where that there is a chance that Snyder is saving this film from falling into a hole but let's be frank, this movie didn't fall into a hole, it was already in a hole and Synder makes no attempt whatsoever to bring itself out of it. When you finish watching this movie, you are left sick, depressed, dirty, and insane. I have a feeling that was the intention of this movie. What is lower than dirt?", "assetId": null}, {"index": 62, "sample": "The final entry in the On The Buses trilogy sees the usual wasters go about their business in Wales. I feel sure the franchise could have continued, but Harold Pinter complained that the screenplays made him look bad in comparison, and so no more were made. <br /><br />It's actually less than two minutes before we get our first dollop of sexism - a woman running for the bus finds her breasts fall out of her dress for no reason whatsoever. Still, it does at least make Stan (Reg Varney) laugh - but then what doesn't? He and Jack (Bob Grant) spend the entire movie laughing uproariously with little or no provocation. You get the impression that they'd wet themselves watching paint dry. <br /><br />As before, the only funny element is the genuinely amusing Stephen Lewis, hilarious as Blakey. He's on his own, though, with a cheesy, dated script that even wastes first-rate talent like Wilfrid Brambell and Henry McGee. Yet it seems as if only Lewis understands how to time the shaky material, wringing laughs out of even the weakest lines. Describing how her daughter fell in a river, Stan's mum laments \"I hope it's not polluted.\" \"Well it will be now\" Blakey quips. <br /><br />The plot - if indeed there is one - sees Stan lusting after a young girl, but being continually thwarted by her domineering mother. It's a recipe for side splitting hilarity I'm sure you'll agree, and whether it's on a storm-lashed boat or the swimming baths, Stan and Mavis's exploits always produce the same result... abject boredom. Later conquests include Maria, an Italian stereotype, and a staff co-worker. Even Stan's mum gets a one-night stand, with Stan considerately reminding her to \"put your tin drawers on.\"<br /><br />When one of the comic \"highpoints\" is Arthur Mullard overhearing Olive trying to locate a light switch in the dark (\"I can't find it\") and thinking she's talking about sex, then you can see why this work reaches the upper levels of literary sophistication. In fact, why it didn't get in the BFI's Top 100 movies is beyond me. <br /><br />Other rib-tickling shenanigans involve Olive (Anna Karen) breaking her glasses. I don't know what's more surprising, the lame predictability of the set-up, or the underdeveloped pay-off. The short sighted Olive follows a man in a kilt into the gents, thinking he's a woman in a skirt. The next shot sees her marched out by Blakey and redirected to the ladies. And that's it. Next, she ends up in another man's bed, and is ordered out by his wife. And... no, that's all there is to that scene, too.<br /><br />When Holiday on the Buses was last screened on British television there was a breakdown in transmission. It actually came as blessed relief.", "assetId": null}, {"index": 193, "sample": "After completing the lackluster novel, Heart of Darkness, I moved on to watch the movie, which was a complete and absolute disappointment. At the onset, I expected that the movie would help put together the jigsaw puzzle of a book. However, even though I had read the novel, the movie still made no sense at all, so I can't imagine how lost I would be if I had skipped the book altogether. It seemed as though the writers picked out their favorite parts and put them in the movie, and left out anything that may assist the viewers in comprehending the meaningless plot. This dreadful movie made no sense at all, and I would strongly recommend against watching it, as it will do nothing more than leave you completely baffled and bewildered.", "assetId": null}, {"index": 198, "sample": "Kinda funny how comments for this film went consistently downhill, now add mine. I think the script could have been saved by better acting, and the acting by a better script. Together, it was difficult to watch, and I don't flinch from such subject matter.<br /><br />Sigourney was the best part (I thought the relationship between her and her surviving son was pretty much the only new thing this film offered to its genre) but even she lagged. Can't blame her, who knows what takes were left on the cutting room floor by the director and/or editor. The whole movie had an \"okay, that's good enough, let's move on\" feel to it, when I KNOW there was more to be mined from the actors and the script, which did have some good lines and some interesting themes.<br /><br />I don't think this counts as a spoiler, but a perfect example is the scene where Sigourney marches up to her son's supposed tormentor's house and has this look on her face and I thought \"that's the face of someone who is overacting what it's like to see someone living in a mobile home\" and sure enough, next shot, meant to shock us I'm sure, bully lives in a trailer as opposed to a nice house, like hers.<br /><br />As many other posters have pointed out, there are SO MANY better movies with similarly airy scripts about similarly messed up families that hit the notes better -- \"Celebration\" probably being the ultimate example that I've seen.", "assetId": null}, {"index": 76, "sample": "\"The New hope of Romanian cinema\"...if this is the new hope, then i wouldn't really like to see the saving hero of such a prolific cinema(Romanian cinema, that is). Now seriously, where should I start? 1. The crappy scenario: are you kidding me, this is not even believable not to mention it's high degree of stupidity 2. the Direction: what direction? This movie should have had psychological tension, at least that, since they have decided to make it look as trashy as possible. Oky, I admit, Radu Muntean is no Polanski, Hitchcock, Fincher or Lynch(the list could go on), but at least the minimum of effort would have been appreciated. 3. The language: Oky, I don't understand why (almost)every single Romanian director believes that if you make the movie as miserable and obscene as possible, then you have art. I don't mind explicit language or bad image quality as long as the final result makes it worthwhile. In this case, it doesn't. There is nothing to comment upon, since everything this movie wants to say was already told thousand times, the characters are far too thinly portrayed to become memorable, the \"shocking events\" that occur are also poorly illustrated and become unimportant. This film relies only on the self-induced emotions, on the \"we must\" hype. Someone was found murdered so \"WE MUST\" feel sad, frightened or panicked, someone went through this and that so \"WE MUST\" feel in a certain way. That's baloney. Because a movie is a piece of fiction, nothing is for real here. So the only true emotions are those that you discover when you wander deep into it's world(the movie's, that is)<br /><br />*/* * * * *", "assetId": null}, {"index": 78, "sample": "This movie is bad. Really bad. So bad it made me want to shoot myself in the forehead. I hated this movie. First off, the plot went absolutely nowhere and anything shocking about this movie was seen in the 30 second teaser trailer. Secondly, Anyone who saw the original in 1979 knows that it was a bad movie too and completely unworthy of a remake. By far the best part of the movie is the house it takes place in. Which is not saying much for the actual movie. There were parts in the movie when the music gets very suspenseful and you're positive someone is around the corner and it turns out to be the maid or the cat, but when someone actually is around the corner it is impossible to be even startled because you've been expecting it all movie. So save yourself the money, save yourself the time, save yourself the headache and just watch the trailer. There is absolutely no point in seeing this movie, not in the theater, not on DVD, not on TV, never.", "assetId": null}, {"index": 81, "sample": "I am shocked to see that this movie has been given more than two stars by some people. They must either be kidding or be totally blind for the art of acting, directing and other flaws of the movie.<br /><br />I must admit that I just could not force myself to sit through the whole movie, it was just too bad.<br /><br />The three first characters, not including the \"digger\" were just awful actors, and I mean AWFUL! Maybe the director didn't care, or may be he is a worse director. It was like watching a bad school play. The movie was of course filmed with a video camera (lowbudget - not real film), and the light settings were not very good either. In addition, the sound man (if they had one) must either have been a newbie or a drunk as the sound were amateurish. Even in one of the first scenes from the kitchen (AWFUL acting btw) the sound from the dialog was pretty bad. For example, when the woman moved her head while speaking, you could hear her voice disappear and come back. It sounded like they had tried to correct that in post-production by turning up the volume a bit when she turns her head. In addition, you had the ongoing irritating buzzing sound from either camera equipment or other sources in the kitchen. <br /><br />All these squeakers in the first 5 minutes or so. Need I say more?<br /><br />A good school project or fun project for friends to watch, but should never have been released for a real audience, especially not for a PAYING audience. THIS WAS A RIP OFF unless you have a very low standard regarding movies, or just bad taste. You are WARNED! SB.", "assetId": null}, {"index": 94, "sample": "There's potential in there with \"Tell No-one\". A curious and intriguing plot, and a French take on a very American story. But for me, the opportunities were not exercised here.<br /><br />Although I liked aspects of this film, there were three prominent failings which pulled it right down to four out of ten.<br /><br />Firstly, it's a silly, clichéd murder mystery. A particularly contrived Murder She Wrote or Bergerac. Being French doesn't eliminate this problem - it's just silly and in French at the same time. It's full of implausible coincidences.<br /><br />Secondly, the transition from the US to France seems to have failed chronically. This French doctor hanging out on \"the streets\" of a French city with his new \"homies\" and their blingin' SUVs... and then there's the car chases...<br /><br />But thirdly and mostly, it's just too darn long. To me, a film needs a good reason to be significantly over 90 minutes, and over two hours takes some serious justification. This once didn't have it.", "assetId": null}, {"index": 108, "sample": "well,there isnt much to say about this movie. its simply trash. very poor acting, poor script, and lame story.... well, the actress,(i odnt even know her name) who played mainrole,(not the blond one,but latina one) was acting fine,but the blond one who played the friend of main charactor,,,her acting level is just like highschool play,so as most of other actors in the movie. Also,zombies,,,,very bad acting as well. and,,the story itself has really no point at all. well, if you are really bored and really got nothing to do,but wanna kill time somehow, maybe you may wanna watch this movie,but eventho,there are still millions of better B movies than this crap. its total waste of money and time.", "assetId": null}, {"index": 115, "sample": "Okay, I agree with all the Barney haters on this site. I think Barney and his friends are all ugly looking and obnoxious and the show is very lop sided and unrealistic.<br /><br />But the thing that ticked me off the most is how Barney presented Gays, Lesbians and Bisexuals on his show when talking about same sex parents and relatives. That wouldn't be so much of a problem if the creators of this show didn't use so many derogatory stereotypes of homosexuals. I mean, not all gay men wear mascara and love the colors purple and pink, and not all lesbians are ugly and manly looking with a bosom that sags to their abdomen. As a bisexual female, I just think this is terrible for a children's show. If this were South Park, I wouldn't mind it, because South Park is for people who can distinguish fantasy from reality. A lot of people who watch Barney are little kids or handicapped people who can't usually distinguish fantasy from reality.<br /><br />And now that I think about it, Barney sort of comes off as an ugly gay stereotype himself. Let's see, he doesn't have a girlfriend, he's pinkish colored and wears clothes with sequins (yes, it's true) on it. If you claim to be for the rights of gay and bisexual individuals, then stop making a mockery out of them in front of people who don't know any better. If Barney went black-face and ate fried chicken and watermelon at the same time, the show would be pulled off the air before you know it.<br /><br />I give this show a negative one out of five. Don't show your kids such hateful crap. There are children's shows out there that are so less insulting.", "assetId": null}, {"index": 126, "sample": "This movie was terrible! My friend and I were so bored by it we fast forwarded through the last half of the movie just to see what happened. It's the typical sports thing, she either wins or she loses. The only remotely interesting thing was when the one guy refers to someone as a Veg-e-tab-le. That will be a line my friend and I bring up for years to come reminding us of this colossal cheesy cliche waste of time", "assetId": null}], [{"index": 2, "sample": "I was so \"impressed\" with Tim Kincaid's MUTANT HUNT that I gave this one a try. It is the near future, post apocalypse of course. A wandering fighter named Neo (no, not that Neo!) joins a group of similar looking fighters to challenge The Dark One and his underling Valaria. Along the way they encounter mutants, crazed females, sewer worms, a big spider leg and some clunky robots. Oh my! <br /><br />Sadly, ROBOT HOLOCAUST is hardly up (or down) to HUNT's level. Clocking in at a painful 79 minutes (the box says 90), this is one cheap flick. The sets have all the elaborate design of a carnival haunted house and the costumes prove that in the near future everyone will dress like John Travolta in the final dance number of STAYING ALIVE. The atomic wasteland is a combination of rubble filled old buildings and Central Park. The Dark One's headquarters is ominously named The Power Station and looks like, well, a power station. The acting is universally bad except for Angelika Jager as the evil Valaria. Jager is a whole 'nother level of bad. Vit er sick Cherman acczent, she gives a performance so amazingly bad that it becomes the sole reason to recommend this film. She also delivers the film's only nudity in the \"pleasure chamber\" section of the film. Ed French again supplies the robot effects but they aren't nearly as slimy as his work in MUTANT HUNT.", "assetId": null}, {"index": 137, "sample": "This tale of the upper-classes getting their come-uppance and wallowing in their high-class misery is like a contemporary Mid-Sommerish version of an old Joan Crawford movie in which she suffered in mink. Here, people behave in a frightfully civilized manner in the face of adversity. A well-heeled London solicitor, (Tom Wilkinson), discovers that not only is his wife having an affair with the local gentry but that she has also killed their housekeeper's husband in a hit-and-run accident. He throws up, but otherwise his stiff-upper-lip hardly quavers.<br /><br />Written and directed by Julian Fellowes, who won an Oscar for writing \"Gosford Park\", (this is his directorial debut), from a novel by Nigel Balchin, it's quite comical although I am not sure how much of the comedy is intended. It's like a throw-back to British films of the forties where characters all behaved like characters in books or plays rather than like people might in real life. However, it's not all bad. Wilkinson is terrific, even if you never believe in him as a person while Emily Watson, (the adulterous wife), and Rupert Everett, (the highly amoral high-class totty), are both very good at covering the cracks in the material. Tony Pierce-Roberts' cinematography ensures that no matter how hard it is on the ear it's always good on the eye.", "assetId": null}, {"index": 139, "sample": "First, I want to clear a common misconception: It is not unrealistic that the school Zoey goes to gives students laptops. At my school, those in grade 7 and higher must have Apple Macbooks (this is payed for in the entrance fee). Moving on. This show is very annoying. It has boring, predictable plots and bad acting. Often in the show it brings \"girl power\" to a new high, with girls beating guys in everything they try. But that is not the worst. The worst is that girls are nevertheless all portrayed as being focused on their personal appearances, and screaming whenever they are happy. Except for the one smart girl, who is portrayed as a freak who is obsessed with ugly boys and science. However, this show is very addictive. I do not know why, but it is. Although, the most recent season has been SO terrible, bringing the stereotypes, boring plots, and bad acting to extremes I never thought were reachable, so I am no longer addicted, thankfully.", "assetId": null}, {"index": 15, "sample": "This is a polarising film. People either love it or despise it, it seems. Me, I despise it. The film comes from the same context as Lindsay Anderson's Oh Lucky Man, but while that is a masterpiece, this is just horrible.<br /><br />Both films take Kafka's unfinished novel - America, for their inspiration and general ideal. America is a surreal story of a youth's travels through the country. Kafka uses the this character as a pure observer, one who does not change over the course of the journey (although the book is about 300 pages and still seems only a quarter finished, so we'll never know). Allowing Kafka to concentrate and comment on the absurd/surreal situations and surroundings. Oh Lucky Man follows this same template to show Britain through the eyes of Malcolm McDowell and Weekend does the same for France.<br /><br />Both films are also hugely Brechtian, using various tricks and techniques to point up the fact that this is NOT REAL, this is confabulation etc. But the difference comes where Oh Lucky Man uses the constructed film to convey the absurdity of life and the class system, Weekend uses the constructed film to bludgeon us to death with ideological polemic. Because Godard goes further than Anderson in his Brechtian principles, we end up with two principle characters in which we have no investment, at all. We're forced to spend 90 minutes with them, yet we couldn't care less about them. Deliberately so. But in doing this, Godard leaves us with a film that is entirely about his own message, which, in the first half of the film is provided through relentless and overbearing symbolism, and in the second half through a series of long speeches directed to camera. Combined with unpleasant and unnecessary scenes such as the really horrible pig slaying, far worse than any of the off camera violence of the car crashes.<br /><br />The end result is like listening to a student political apparatchik droning on and on and on about his views whilst repeatedly kicking you in the head so that you get the message. The problem with Brecht is, if you alienate the audience too much, then you've alienated them from what you are trying to convey. Which always seemed self evident to me.<br /><br />The parts that really stick in the craw for this movie though, is the contrast between the extremely sexually explicit verbal description of the threesome at the start and the off-screen comical rape in the middle, which, even if it could be viewed as allegorical, completely destroys the film's faith in itself and it's characters, what little of it existed in the first place. It's so French with a capital F, it hurts.<br /><br />Watch Oh Lucky Man instead. That is a work of genius. Weekend is a work of pretension.<br /><br />Two stars, and only for the traffic jam scene and the piano scene, which are just hints at genius, although they actually make the end result more frustrating and unsatisfying as without them, this is a bad film by the worst most pretentious director in the world, with them, well it's obvious that this is a damn good technical director making the most intellectually pretentious film in the world. Somehow that's far worse.", "assetId": null}, {"index": 143, "sample": "This is without a doubt the most poorly thought out movie in history. The invention gags by Carrot Top are some of the most awful attempts to be funny in recorded history. I am not familiar with his other work, but if it is half as bad as this then I am just going to cry. I give this movie 1 out of 30 billion stars, and may God have mercy on the souls of those responsible.", "assetId": null}, {"index": 144, "sample": "I have been collecting Iron Man comics since the early 70s and always enjoyed the character who is far far from the average clean cut hero and his many and varied enemies. There have been no less than three attempts at an animated series for Iron Man and only the original and part of the second have ever done the character justice. So I was somewhat hopeful that this newest version would be good. Boy was I wrong! The DVD art is VERY misleading and presents an image that is not the movie. Fist off the good, what little there is... The art and animation are well drawn and the writing and dialog are generally good, though with notable exceptions. Character voices are very well selected and each character is distinctive and well acted. Now for the bad... Unfortunately the writers opted to totally screw around with both Iron Man's origin and especially the Mandarin's. On top of that they decided to do Iron Man and his opponents all in CGI. Bad CGI. This makes them stand out almost as badly as live actors would in a cartoon. The CG work is often repetitive and glaring shortcuts are taken at times. The CG battles are clumsy as well, further enhancing the fact that CG and line animation do not mix well. The movie would certainly have fared better had they opted to actually DRAW all the characters. Another problem is that Iron Man is in his traditional Red and Gold suit for all of ONE battle! And its not even the big fight at the end. All this drags the movie down and it never picks up.<br /><br />************ SPOILERS (or warnings) MAY FOLLOW ************<br /><br />The movie starts off with an interestingly unusual stop motion credit sequence of machinery, welding and gears. Then we are introduced to what looks like a Chinese temple in the process of being restored, and prominent is a statue of what fans will recognize as the Mandarin. Things go strangely, impeding progress in restoring the temple. Overseeing it is James Rhodes, Tony Stark's long time friend. Seems they plan to actually raise the temple up from the earth, despite opposition by a group who insist that raising the temple will bring about a terrible disaster. Rhodes is captured in a raid. Stark, shown in a hot tub with a lovely lady, is informed of the problems and sets out to personally oversee the project and rescue his friend while in the background his father deals with Board Executives who are pushing to have Tony removed. Tony arrives only to have his armored escort ambushed and blown to pieces. Tony later awakens mortally wounded in the heart and a prisoner of the rebels. He is saved only by quick action from Rhodes and a scientist. Eventually Stark must build the prototype gray iron armor and makes good an escape, but only after some loss of life. While with the rebels he meets a troubled girl named Li Mei, and the two fall in love. The Temple is raised and four elemental beings (all done in CG) appear and proceed to start collecting hidden rings of power. Stark and Rhody find trouble back home but manage to confront the elementals without success in really stopping them, First using the Aquatic Armor, then the more classic Red and Gold Armor and finally everything returns to the temple and Stark is back in the bulky gray armor for a final showdown and a run in with what may be Fin Fang Foom (also in CG.) Here the story takes a major twist as it turns out that the Mandarin needs a host body to manifest. This leads to a somewhat tragic final battle marred by the fact that the Mandarin is little more than a ghost and isn't seen till the last 5 minutes of the movie. ugh...<br /><br />If you are an Iron Man fan then you will likely not enjoy this outing. And even non-fans may well find the movie somewhat lacking or not.", "assetId": null}, {"index": 21, "sample": "This is a new approach to comedy. It isn't funny.<br /><br />The joke is that this, in and of itself, is supposed to be funny.<br /><br />The story is based on a French short story, located in Paris, and the characters have French names. Louis Aubinard, for example ... played by ... Bob Hoskins? The movie also stars the equally French Jeff Goldblum and Natasha Richardson. The situations are similar to and the characters perform as if in those Carry-On movies from years back.<br /><br />I believe these are also jokes - to cast these actors who make no attempt to act French in any way, to have them cavort in the manner of broad English dance hall comedy, and to leave the whole bloomin' mystery unexplained to the audience.<br /><br />In the humour department, this is practically the Algonquin Round Table, isn't it?<br /><br />The movie tries to be charming and quirky, and I guess these characteristics are sort of funny. Not as funny as Duck Soup or Love and Death, perhaps, but funnier than The Deer Hunter or The Battleship Potemkin.<br /><br />It is an example of personal filmmaking. It makes no real effort to reach out and share with the audience, but stays true to its premise and its internal logic. Although all the situations are unbelievable, they are logical within the film's own bizarro world.<br /><br />I generally like this kind of eccentric movie, but I found this one to be paced too slowly, to be dull-witted, tedious, and to provide too few pleasurable surprises or genuine wit. It just kind of meanders in predictable and sophomoric ways, and wastes some wonderful talents along the way. It has to be the low point in the career of each of the major stars, who are all otherwise distinguished players. I found it to be the biggest waste of talent since The Betsy, and I wish I had never seen Goldblum and Hoskins in this thing.<br /><br />So, call it an interesting miss, and pass on it as a rental unless you really have a lot of time to kill.<br /><br />", "assetId": null}, {"index": 150, "sample": "First, let me mention the fact that, in spite of its title («Stories», in plural), there is only ONE Kitchen Story. As to whether Isak died or not at the end, I'm not so sure since, in one of the very last scenes, HIS PIPE is seen lying on the table next to the two cups. On the DVD cover, there is a reference to Tati. It claims that the film is «très drôle: rappelle Tati !» («Very funny: reminiscent of Tati!». The great Jacques Tati relied mainly on mime and silent deadpan attitudes to achieve his comical effects and to offer his critically satiric views of his 1950’s French «modern» society. Of course «Kitchen» does take place during the 1950’s and it does offer some (rather faint) satirical references to the absurdities of bureaucracy and there are some long moments were no words are uttered -– but they are not really funny. Are all these small details enough to make «Kitchen» a «Tatiesque» movie ? This being said, I have to admit that «Kitchen» does deal with the sometimes false objectivity of scientific research versus the «truth» of human subjective emotions. Generally speaking, the movie was agonizingly slow, with nothing much happening -- with barely any «dramatic impulse» : the involving parts were the set up during the first 15 minutes or so, and during the last half hour or so. Indeed, the last segment was -- FINALLY !!! -- interesting and moving. It might seem that it was a short subject, of less than an hour, unduly stretched to some 90 minutes. Now, about the set-up (a «scientific» observation on the behavior of single males in their kitchen): at first it seemed very promising –- with the charting out of the comings and goings of bachelors in their kitchen as a means to determine what new inventions would be most useful to come up with. But very quickly this premise turned out to be just a prologue, an «excuse» to introduce the real subject which was only fully developed towards the end and which was about loneliness and the invaluable bond of friendship. Pity ! I honestly wanted to like that movie. Yes, it seemed so promising when I heard about some of its unusual little «anecdotes» -- which were indeed there and which I enjoyed -– such as the burning of a man’s nose hair (instead of using scissors to cut it off), the «investment» of having a huge quantity of «valuable» black pepper stacked away in a barn, the role reversals (the observant becoming the observed), a man’s mouth emitting sounds from a radio program. And there is also a sick horse becoming the catalyst of half-hidden human despair, the relative importance of right or left side car driving in Sweden and Norway (a reflection of the importance for each of these very close neighboring countries to affirm its individuality ?). Am I the sole person who did not fully enjoy that film ? Does this necessarily mean that I'm wrong ? Perhaps it’s almost generally praised «fine points» were, in fact, «too subtle» for me ? Perhaps... Could my individual views on this movie ironically reflect the very essence of the film itself -- which would be the vital necessity to have the right to differ, to affirm one’s individuality and not to follow blindly society’s trends and opinions ? Each one of us has the right to have different personal views and not to be a slave of the demands of one’s bread-winning «dictatorial» demands: often, we do have other alternatives that would allow each one of us to be useful to our society while respecting one’s inner principles. In short, being true to oneself -– the way that in that film Folke (Isak’s «scientific observer») ends up by giving up his job while preferring to stay in his new friend Isak’s house and help his out with the tasks of his farm ... And so, «Vive la différence», as the French say !", "assetId": null}, {"index": 23, "sample": "I saw this cartoon accidentally on television one night when I couldn't get to sleep. It didn't help in the slightest. I found myself staring up at the ceiling, trying to forget that face. I could quite happily never see this cartoon again, simply because of that face.<br /><br />Now, don't get me wrong - I love fairy tales and nursery rhymes as much as anyone. But this twisted and terrifying rendition simply is disturbing. It is mainly the cruel laughter, and the exaggerated features that terrify me, and I still have nightmares because of it. Please, I urge you not to allow your children to see this. It is far, FAR too scary. Please, I pray you, keep it away.", "assetId": null}, {"index": 154, "sample": "It's exactly what the title tells you...an island inhabited by fishmen. Shipwrecked doctor Claudio Cassinelli and crew land on the island, they're either picked off by the fishmen or roped into working for treasure hunting lunatic Richard Johnson. Cassinelli discovers that Johnson, who believes he's found the lost city of Atlantis, has been keeping disgraced scientist Joseph Cotten and his daughter Barbara Bach hostage for 15 years so the fishmen can uncover a treasure trove beneath the sea. Cotten, of course, is a complete madman. Bach and Cassinelli have great chemistry. This insanity was directed by Sergio Martino and is not, surprisingly, without merit. It's fast paced, reasonably well acted and the fishmen look pretty convincing (though it's unlikely anyone could prove that these things DON'T look like actual fishmen). There's an excellent music score by Luciano Michelini.", "assetId": null}, {"index": 167, "sample": "Johnnie (Bert Wheeler) is a would-be songwriter; Newton (Robert Woolsey) is a would-be inventor. Both work at a cigar stand in the lobby of an office building. Johnnie wants to sell a song to Winfield Lake, a song publisher who also owns the building. Lake's secretary, Mary (Betty Grable), is Johnnie's sweetheart. When Lake turns up dead, circumstances conspire to make Mary and Newton think that Johnnie is the killer. They conspire again to implicate Mary, who goes to jail. But who really shot Lake? Who is the Black Widow, the blackmailer who had threatened him? The other characters in this wacky murder mystery are: Lake's suspicious wife, a self-satisfied private detective, a seemingly slow-witted janitor (Willie Best), Lake's auditor, a songwriter who thinks Lake is stealing from him and another who thinks everyone is stealing from him. It's up to Newton and his truth machine to reveal the real killer.<br /><br />The baby-voiced Wheeler and the cigar-chomping Woolsey strike me as an arbitrary pairing, but they made several movies together in the 30s and some of them were funny.<br /><br />Not this one. George Stevens, who went on to have a distinguished career, directed this dismal comedy with a tedious murder mystery plot. But two scenes are good, and both feature Wheeler and Betty Grable singing the excellent \"Music in My Heart,\" written by Dorothy Fields and Jimmy McHugh. The first time, they sing it walking up a staircase (after which they dance back down). Later, Wheeler and Woolsey are on stilts so that they can see and talk to Mary, who is in a jail cell on a high floor. Wheeler and Grable sing to each other through the bars.<br /><br />\"The Nitwits\" has a few laughs, but the level of comedy is best illustrated by Woolsey's line: \"Sonny, you've got the brain of a six-year-old boy. And I'll bet even he was glad to get rid of it.\" It's watered-down Groucho\u0097who didn't use the superfluous \"even\" when he said it.", "assetId": null}, {"index": 40, "sample": "The 1998 version of \"Psycho\" needed to be set back in the 60's, rather than present day. The headliners would have done a good job with the setting. There were two scenes that just stuck out like a sore thumb. The first one was at the beginning of the movie when Marian Crane (Anne Heche) was sitting at her desk. Her boss took his client into his office because \"it was air conditioning.\" I imagine that the majority of Arizona businesses have air conditioning. The other was the meeting of Lila Crane (Julianne Moore) & Sam Loomis (Viggo Mortensen). Lila sporting the Walkman seemed like an exaggeration to update the movie. The movie did spook a number of the viewers in the theater.", "assetId": null}, {"index": 44, "sample": "What crack are you smoking? This movie, while gloriously entertaining, is awful! <br /><br />The action scenes are so obviously fake it's kind of sad. The colonel's daughter is painfully irritating. The ninja training camp is so hilarious it is almost not worth mentioning. And when Joe puts the bucket over his head and beat up the other army guy, I just about peed myself. I could go on...<br /><br />Entertaining, arguably so. Good, no. Well made, certainly not.<br /><br />As a commentary on America as empire, it's actually pretty good. Joe as a typical white conqueror isn't all that surprising, especially in the context of mid-1980s American cinema.", "assetId": null}, {"index": 55, "sample": "\"Love Life\" explores a very culturally relevant scenario of a marriage of convenience between a lesbian and a gay man. I found the subject matter compelling, even if the conflict was a bit forced and too easily resolved. For example, Thomas falls for Joe a little too quickly and conveniently for the plot. There are many continuity errors: one other user commented on different cars in the garage, Joe's glasses...the one that got to me the most was the fact Joe's facial hair configuration seemed to change from scene to scene. In the end, I found myself more turned-on by this movie than moved. Stephan D. Gill has a pretty nice body and shows it all quite a few times with pornstar skill and exuberance, and all-too-often acting chops to match. Many times, the movie seems like it is going to go full-on porn. Stephanie Kirchen does a fine job, but her moment of enlightenment at the end was sullied a bit for me, since I was in the mood for a good romp in the shower by the end of this movie.", "assetId": null}, {"index": 187, "sample": "In the twilight years of his career, Charles Bronson forged long-running partnerships with several directors, most notably J. Lee Thompson and Michael Winner. He did two films for one-time Bond director Peter Hunt too - the first being the decent 1981 actioner Death Hunt, the second being this indifferent political chase thriller. Assassination is pretty dull if truth be known, and come the end you'll find yourself longing for something with a bit more passion and pace, like The Wilby Conspiracy for instance (which, plotwise, this film resembles).<br /><br /> Bronson sleepwalks through his role as bodyguard Jay Killian, whose assignment is to protect the American President's wife, Lara Royce Craig (Jill Ireland, real-life wife of Bronson). Killian believes that Mrs Craig has been targetted by assassins; she thinks he's an over-protective, paranoid pessimist. Turns out - surprise, surprise - that Killian was right all along and someone is indeed out to eradicate her. The pair of them go on the run, pursued by the assassins.<br /><br /> Everyone knows that the wife of an American President is known as The First Lady. For some reason, in this film they have renamed her \"One Mama\"! Quite what the point of this is is anybody's guess, but it's indicative of the film's pointlessness as a whole. Most of the film's performances are lazy, and the script takes a heck of a long time to get to where it's going. If I had to label Assassination within a specific genre, I'd say it is supposed to be a \"thriller\". I'd say that with some reservations, however, as to say that it's a thriller it has precious few thrills.", "assetId": null}, {"index": 191, "sample": "This is one of the worst mini-series I have ever seen on TV. I sat through the first half hoping it would improve but it only went from bad to worse. Needless to say I could not bring myself to sit through the torture of a second nights viewing. What was Jon Voight thinking when he made this?????", "assetId": null}, {"index": 70, "sample": "This is one of those inoffensive and mildly entertaining little movies that strive to make you to like them more. But like so many others, it's material isn't strong enough to successfully fill a couple of hours.<br /><br />The pitch is promising: three drag queens drive a bus through the Outback from Sydney to Alice Springs. They run into lots of trouble - with homophobic locals, with the engine, with their pasts.<br /><br />The real trouble is with the dialogue. The leads are fine (though Pearce's continual campness becomes tiresome), but the one-liners and epithets feel forced where they should be casually thrown away. Characters shouldn't laugh at their own gags.<br /><br />Writer/director Elliott also feels the need to pile on the pleasingly incongruous shots of flamboyant drag costumes against stark desert backgrounds like so much cheap make-up. For a movie about self-confidence and just being yourself, it all seems very insecure with itself.", "assetId": null}, {"index": 79, "sample": "As someone has already mentioned on this board, it's very difficult to make a fake documentary. It requires tremendous skill, pacing, patience, directorial 'distance,' a plausible premise, a narrative 'flow,' and REALLY believable acting (aka GREAT acting). <br /><br />Such is not the case with 'Love Machine'. It starts to show its faux hand about the 20-minute mark (with 60 minutes left to watch), and the viewer starts to realize that he or she is being taken in. It's downhill from there.<br /><br />Director Gordon Eriksen simply peaked too soon. But to be fair to Eriksen, his problems started early: as he explains in the extras, he began wanting to do a REAL doc, couldn't get funding, and settled for a cheaper way of making his film.<br /><br />The premise -- people who have secret lives by posting themselves on a porn website -- was perhaps more interesting in 1997-98, when the film was made. Eriksen does a lot of tricky stuff -- a pushy 'host,' hand-held cameras, zooms, grainy blacks and whites -- all, I guess, to elicit a sense of authenticity, but it just doesn't work. The film is confusing and forced, but what ultimately brings it down is the believability of the actors and the pretty awful dialogue.", "assetId": null}, {"index": 84, "sample": "There are a few scripts like this one floating around Hollywood; this one is not even close to the best--just the first. This is all production value, no substance, but the Disney name probably will help it. A good idea, a wasted opportunity.", "assetId": null}, {"index": 86, "sample": "I was prepared for a bad movie, and a bad movie it is, so I guess I shouldn't complain. Twentysomething Tom (gay poster boy Robert Stadlober) has so many issues he doesn't know if he's coming or going. I wouldn't have stayed but for the pretty girls: Serious Mavie (Anna Brüggemann); no-nonsense Angie (Emma Daubas); Sarah Baumann as the star of the movie within the movie. And then there's Tom's soul mate, wild-eyed Margarete (Jana Pallaske). She reminds me of Béatrice Dalle and Gina Gershon. If you've got to remember, these are fine memories. She looks good even in the most ridiculous outfits, and I mean ridiculous, even by Berlin standards. I wonder whether I'd have liked this movie when I was the characters' age. My guess is I wouldn't. Watch out for indie idols Oli Schulz and Max Schröder of \"Der Hund Marie\" performing as street musicians, feeling no pain.", "assetId": null}, {"index": 90, "sample": "Terry Cunningham directs this Sci-Fi Network original. All is not well in Washington state and Oregon; volcanic eruptions and earthquakes threaten to drop most of the Pacific Rim in the ocean. Trying to keep the world from plunging in ecological havoc, a crack team of scientists led by Dr. Jake Rollins(Luke Perry)take a massive earth drilling vehicle called \"The Mole\" to chew its way to the Earth's fiery core to avert impending doom. Technical dialog doesn't really help or speed this movie along. The acting is lame, but then Perry has always been laid back. You can only blame him for taking part. Others in the cast: Michael Dorn, Adam Frost and Michael Teigen", "assetId": null}, {"index": 91, "sample": "This film may be great, but it is a complete ripoff of Bill Forsythe's Comfort and Joy. c&j is one of the sweetest films I've ever seen without becoming diabetic.<br /><br />It's OK if you do like it, but realize that EVERYTHING in this film is a direct rip-off.<br /><br />The original is http://us.imdb.com/title/tt0087072 I can recommend almost anything by forsythe - Local Hero, Gregory's Girl, That Sinking Feeling. I better go rent some tonight. Local Has a young Peter Capaldi, and an old Burt Lancaster.<br /><br />Unfortunately he's given up film-making after some really crappy Hollywood treatment. Sad.", "assetId": null}, {"index": 105, "sample": "The message of Hero is quite clear: the idea of Greater China is more important than the death and the suffering of millions. At a time when China is dangling its war toys over Taiwan, it is unacceptable for Western viewers to endorse this piece of over-produced, government-sponsored, dogmatic trash.<br /><br />Particularly surprising is the promotion of this film by the liberal media. Roger Ebert of Chicago Tribune, David Edelstein of Slate, Charles Taylor of Salon, and many others have wholeheartedly endorsed Hero. In so doing, they have implicitly legitimated its reactionary political message. The only critic (that I know of) who saw through the film's glossy facade was J. Hoberman of The Village Voice, who wrote of the film's \"sanctimonious traditionalism\" and its \"glorification of ruthless leadership and self-sacrifice on the altar of national greatness.\" I, for one, sign my name under Hoberman's final pronouncement: Hero is nothing more than \"fascinating fascism.\"", "assetId": null}, {"index": 109, "sample": "Of the four main players in here - John Candy, Jean Kelly, Amy Madigan and Macauley Caulkin - the only one I've never heard about (at that time) was the one that annoyed the heck out of me and ruined the film. Well, she must have done a decent job of acting to make me want to throw her and the VHS into the garbage pail. I am referring to Kelly in the role of teenage brat, \"Tia Russell.\" Ironically, six years later she played a stunning and extremely likable role in the person of \"Rowena Morgan\" in \"Mr. Holland's Opus.\"<br /><br />Candy, as usual, is fun to watch as \"Buck Russell,\" or the title character, \"Uncle Buck.\" Few actors were better at playing a lovable, hapless slob than Candy. I enjoyed his character in here, but I cannot watch that spoiled teen girl more than once. Also, in the first few minutes of the film, the little boy \"Miles\" (Cauklin) says the word \"G-damn.\" How bad is that, having a six-year-old kid saying the Lord's name in vain on film? These Hollywood people are such sickos. No wonder many of their child actors turn out to be mentally screwed up, Caulkin being a case in point.", "assetId": null}, {"index": 113, "sample": "**Possible Spoilers Ahead**<br /><br />Whenever fans of bad movies congregate for more than a few minutes, a name that invariably comes up is that of Larry Buchanan. This amazing director has given us remakes of other turkeys (ZONTAR THE THING FROM VENUS), cheap-jack crime dramas like A BULLET FOR PRETTY BOY, and tawdry conspiracy flicks like DOWN ON US and GOODBYE NORMA JEAN. THE LOCH NESS HORROR is a humdinger to say the least. Overlooking the fact that Loch Ness is extremely long and narrow, Larry filmed this howler on a wide and round California lake. Early on, the film boasts some dazzling (for the budget) underwater photography and creates some atmosphere in spite of itself. Then it degenerates into windy dialogue uttered by no-name actors with lapsing Scottish accents, not to mention a soundtrack that will do nothing for the much-maligned bagpipe. At one point, campers sing \"You Take The High Road, I'll Take The Low Road,\" just to throw in one more Scottish cliche. If Scottish people ever decide to jump on the Political Correctness bandwagon they'll sue Larry Buchanan over this film, his surname notwithstanding. The monster looks like a giant papier-mache puppet and it makes the dragon in Beanie & Cecil look terrifying by comparison. In one unforgettable scene Nessie takes to land and, to evade some patrolling soldiers, the fifty-foot long critter tries to hide behind a tree-and the soldiers don't see it! THE LOCH NESS HORROR is a true mind-boggler that must be seen-several times--to be believed.", "assetId": null}]], [[{"index": 1, "sample": "The Ali G show was really something amazing - he was so stupid wannabe rapper, but no one he interviewed noticed that he was just pretending. Sasha Cohen is actually very intelligent guy, who pretends to be stupid, so he could get really honest answers from people... And it is very funny. So I didn't expect movie to be good, cause it was all acted - no real people or interviews. So the basic point of all show was lost. But I was wrong - I laughed all the time, it was one of the funniest films I ever saw. Sure it was stupid, but who cares if you can't actually brake in to safe with a car battery, like someone said? It wasn't supposed to be a realistic documentary... And it isn't like the show, it goes in totally different way, but that doesn't mean it is bad. When I finished watching I was totally impressed, but now when some time passed I realized that it was not that special anyway, But it still deserves a nine - well at least for what it is supposed to be.", "assetId": null}, {"index": 129, "sample": "Although it strays away from the book a little, you can't help but love the atmospheric music and settings.<br /><br />The scenes in Bath are just how they should be. Although if you have watched it as many times as I have you notice that the background people are the same in each scene, but that aside, I like the scene where they are in the Hot Baths, but did the men and women really bathe together like that? You could see all the men perched around the outside leering at the women. It also seemed strange that they all had their hats on, but perhaps this was the style at the time. The ballroom scenes were very nice, the dancing and the outfits looked beautiful. I especially liked Catherine's dress in the first ballroom scene.<br /><br />Northanger Abbey looked suitably imposing, but I enjoyed the Bath scenes better.<br /><br />Schlesinger gives a good but not exceptional performance as Catherine Morland. Googie Withers gives the best performance as Mrs Allen I feel.<br /><br />Ugh Peter Firth as Mr Tilney, he just talks a load of rubbish, and is not a clergyman as he should be, it's hard to think of him being in love with Catherine, but then the book never really gave that impression either.<br /><br />General Tilney is played reasonably well by Hardy, and Stuart also gives a sort of good performance as Isabella. Ingrid Lacey did not give a good performance as Elinor Tilney. As for John Thorpe, well he gives the impression of a seedy and lustful man, perhaps not the character portrayed in the book, but I quite like it.<br /><br />I can handle scenes being cut from a book adaptation, but when new scenes and characters are added it usually annoys me. The marchioness! I hate her. She is not part of the Northanger story and neither is her cartwheeling page boy.<br /><br />some of the script is peculiar. When Catherine is asking Elinor Tilney about her Mothers death she asks \"I suppose you saw the body? How did it appear?\" What a silly thing to say! Elinor's calm response is stupid too.<br /><br />anyway please tell me if you agree or disagree with me", "assetId": null}, {"index": 35, "sample": "I thought that this movie was going to be totally lame based on the advertisements that I saw in theaters. When my sister borrowed from a friend I decided to watch it because it was summer and there was nothing else to do. . .needless to say ten minutes in the movie and I loved it. Amanda was a great actor in the movie, her comedic timing was perfect. The guy who played Duke was hot, plain and simple. My favorite scene was definitely when Amanda walks by the gardener and a fellow student who is suspicious of her and she is talking to her mom about dresses--as she is pretending to be a guy! I re-watched this part over and over... to make a long story short, the movie I thought was going to be lame--I now own it.", "assetId": null}, {"index": 36, "sample": "I can't explain it, but I find this movie not only funny, but so enjoyable I feel compelled to watch it over and over, or at least I did when I had cable TV. I always felt it was a really poorly made movie, but perhaps that is because I watched it on cable. I plan to get a DVD of this movie to really take an honest look at at, but more importantly to just have a good time watching it. I liked the plot and the idea of the movie and I especially liked the cast. I always wonder if the cast enjoyed making the movies they are in and this is no exception. This film deserved a better fate than it received and Kelsey Grammar deserved at least one love scene with Ms. Holly. Who wouldn't? The characters in this movie were the kind of guys I could identify with when I was in the military and the zaniness was exact. Nice going troops.", "assetId": null}, {"index": 37, "sample": "So Udo Kier earned like nine bucks and free food for this so that is a victory in and of itself. <br /><br />More importantly this movie tells a very interesting tale about a group of salvage guys coming across the broken down Demeter. I should warn you, i'm gunna bounce around through this review real quick so buckle up. First thing's first. Coolio plays a guy named 187. 187 likes drugs. 187 finds a bunch of caskets on board and... now i don't know anything about the future but maybe they smuggle drugs in caskets. Not gunna say that was the craziest thing in this movie. Later on the vampire gets out of his mist filled coffin and then the real hilarity begins. First, although this movie has the word Dracula in it he is actually not in this movie. I have a theory though. Out of the blue you see the salvage crew's ship leave without them. My theory is that Dracula was on board with his retarded brother Orlock. Dracula told Orlock he'll be right back. Dracula got the hell out of this movie before he could be seen leaving Orlock to play the vampire for the six or so minutes he is in the movie. The best part of this film, and for those of you that have seen this you know what i'm gunna say, is after 187 gets sired, embraced whatever. He has this huge monologue about ejaculating on various parts of erika Elaniak's body and... other super cool stuff. Coolio, seriously you are the best thing EVER. <br /><br />Some other stuff happens in this movie too. Like Casper Van Dean gets some work. Orlock screams a lot and loses his arm and then we kinda lose track of him FOR THE REST OF THE MOVIE. And thank god really. We find out Erika's character is a police bot. As the movie comes to a close we find out that the ship is on a course to ram into the sun. The police bot and one other surviving character are doomed. Rather then avoid certain death Erika's police bot reveals she's also a whore bot and they decide to screw each other and die. Before they die in the sun they die for no reason, yep that's right... their ship blows up for no real reason. <br /><br />This movie got the amazing rating for one reason, Coolio. My god, if they gave academy awards to black rappers then he'd be the first to get one. The only reason this didn't get a perfect ten is because there was not a drop of nudity. Now i know what your thinking, how can you judge a film by whether ladies show their goods or not. Well easy. A movie like this pretty much requires it. Its part of the process. Gore, gore, monsters, nudity, gore, end of movie final shock at the end. Its the formula. This had some gore, the monster was awesome because he sucked so hard he actually did us the favor of staying off camera. That was considerate of him and i respect that. Nudity, not a drop even though there was a length conversation about... well see the above statement and as for the shock/twist... i certainly didn't see the end coming. That counts. <br /><br />I hope Hollywood doesn't think Coolio gave this film his all and has nothing left. He deserves more work. Well, until Dracula 4000, i'm out.", "assetId": null}, {"index": 69, "sample": "My brother got me hooked on Carlin back in the 70s. I always loved his observational humor. That is, looking at every day things and finding the humor in it, like asking the question,\"Have you ever tried to throw away an old waste basket? You can't do it! They keep bringing back to you!\" And asking questions like why is the word kill more acceptable then the \"F\" word, while making prefect sense with the discussion.<br /><br />However, during the 90s his stuff was less funny, and more angry. What he seemed to be doing was holding a mirror to society's face and say 'take a look!' At this point, his shows were less of a comedy show, and more of a gripe session. But in all fairness he always made a tremendous amount of sense. He really made you think.<br /><br />Here was Carlin old and new. He starts out about the fun one could have by getting old, and later slamming the the state of the world. Again making perfect sense.<br /><br />This was his best since \"Jammin' in New York\", and as it turns out his last.<br /><br />I think what 'The Shootist' was to John Wayne, or 'A Prairie Home Companion' to Robert Altman, 'It's Bad For Ya' is to George Carlin. A fond farewell to a true great icon. Love him, or hate him, I think he will be remembered.", "assetId": null}, {"index": 99, "sample": "The animation quality here is decidedly below par IMO, regardless of the age of the OAV. The plot itself makes sense, but the characters don't.<br /><br />This might sound picky, but considering that the city of Olympus is almost exclusively populated by living machines, would YOU feel comfortable there as a human? Would any machine ever emulate human arrogance, short-sightedness and greed quite so effectively? I doubt it. There are some pointers towards this in the movie, but only when the team can be bothered to put them in, by and large the 'bioroids' (or whatever they are) are interchangeable with human characters. Seems sloppy to me.<br /><br />The main characters seem to have some kind of emotional entanglement, though no light is shed on this. Little light is shed on the backstory at all, a great pity. The short length of the film coupled with the focus on mecha and the crime means that we don't see any character depth. The groundwork's all down, yet we're left with no finished product. A cropped version of this OAV would have made a great TV episode, once some character sub-plots had been established.<br /><br />The highlights of this short film are the mecha designs and the action/espionage.<br /><br />The flaws really start to show through once you've had a chance to digest all the goings-on, so I couldn't recommend this for owning, but it's certainly worth a watch or two! Whilst this review is mostly negative, I really do think it's worth your time to watch this, but it's not something to rush out and buy. <br /><br />In a nutshell: A watchable wasted opportunity.", "assetId": null}, {"index": 77, "sample": "Stephanie Meyer is going to be so ticked! Now, her book \"Breaking Dawn\" will not be first with that title. Sorry, Twilight fans.<br /><br />Kelly Overton (The Ring Two) is medical student, Eve, who is assigned to interview psychotic Don (James Haven - Angelina Jolie's brother). I suspected the twist, and when she found out they both grew up in the same town, I was sure of it.<br /><br />She kept getting deeper and deeper with her patient to the point that I felt there was a shared delusion going on. At times, she even acted like she had PTSD. I really thought she was losing it.<br /><br />Well, she wasn't losing it, and when the end came, I was floored. My whole suspicion turned out to be wrong. The twist was even more amazing than I believed.<br /><br />Overton was fantastic and the story is so much better than something Stephanie Meyer would come up with. A must see.", "assetId": null}, {"index": 175, "sample": "When you have waited years to see a film that you have heard on the grape vine about obviously your expectations are high right? f**k yeah!But when this baby dropped through my door little did i know what f***ed up visuals would grace my TV and warp my fragile mind. First off Karim Hussein is a film fan like all of us growing up on a diet of Argento/Fulci/lynch etc.....and it shows in this film, but in a good way. Although i didn't really know what the hell was going on on my first watch of this gem i was just amazed by the visuals,the lighting and of course the performances from everyone who was involved Karim must have truly believed that he was going to push the boundaries in film-making(which trust me he does)and that he was going to have a hard job convincing the actors to do the same........<br /><br />So what can i tell you about \"subconscious cruelty\"?Well without spoiling it....its a deep insight into the human psyche with images of violent and sexual madness which toils into madness.....a truly unforgettable experience.......<br /><br />keep you eye on Karim Hussein he can only go onto better things.....<br /><br />I viewed the full uncut print of subconscious cruelty on a double disc DVD from Infliction films which is loaded with extras.....please note there is a censored hong Kong release out there avoid this version.", "assetId": null}, {"index": 148, "sample": "At the beginning of this film, which I found myself watching on IFC in the wee hours of the morning, I was filled with a sense of claustrophobia and general discomfort. The feeling of being trapped with no way to escape was so powerful that I didn't know if I wanted to continue watching...although it didn't really seem to me that I had much of a choice, so compelling was the situation.<br /><br />Gradually, though, that feeling of discomfort waned (although it never really disappeared entirely), and I felt drawn into Tessa & Bobby's predicaments, and really just hoping against hope that they might get back together.<br /><br />Really just a moving, powerful story fit snugly into a tiny package. I had no idea that Sarah Polley had anything to do with it until perusing her trivia, so now I love it even more.<br /><br />I definitely recommend it. ...If your lucky enough to catch it on the Independent Film Channel sometime, or wily enough to figure out some other way to view it.", "assetId": null}, {"index": 85, "sample": "When I went to the video rental store, back in the days when DVD was yet next to unknown to me, I had seen all the movies at the store that I was interested in. Or so I thought! The man behind the counter told me he had something for me that I definitely would like. He gave me \"Plunkett and MacLeane\". At first, I doubted it to be any good, but I trusted his advise and... man, I sure am happy I did take this jewel along! This is one of the best adventure movies in years, if you ask me! Of course, with Robert Carlyle as a major part, how bad can a movie get? Surely, Liv Tyler does once more what she's good at and nothing much more: being pretty. But still, you can very clearly sense that the cast apparently had a lot of fun, making this movie.", "assetId": null}, {"index": 149, "sample": "I'm sure all of the Canadians on IMDb are all too familiar with Canadian content, and how much of it is... well, shall we say, lackluster. There are a select few Canadian shows that are actually worth watching, however, this is definitely one of them.<br /><br />Simple premise. Two guys picking up girls in a bar with certain guidelines and rules, add in some witty and clever commentary from a group of surprisingly likable self-proclaimed \"Alpha Males\" and you have yourself some very entertaining programming. Each episode is solid. If the \"players\" are sub-par, there are some awkward moments to be had, and there is some gentle fun poked at them. If the \"players\" are good, it leads to moments that you just have to stand up and applaud, and some comical praise lavished at them.<br /><br />The premise is kind of trashy, I know, and as a guy who usually takes pride in the fact that I'm elevated himself above typical, terrible reality television, it takes a lot for me to admit that this show is actually funny and enjoyable.<br /><br />One thing that must be pointed out is how The Comedy Network did a terrible job marketing this show. For the longest time, I didn't even know the premise, and all I knew was that there was somehow a shirtless guy who \"loves cougars\" involved. However, after actually watching the show, I was surprised by how surprisingly slick it looks for Canadian content (despite a pretty lame opening credits sequence). So give it a chance. I have yet to find someone in the target demographic (18-30 year old males) who have actually watched the show (and not just the annoying commercials) who hasn't liked it.<br /><br />Bring it back for a third season, Comedy Network. It actually has a good premise, as opposed to some other Canadian shows you've had (cough*girls will be girls*cough). I usually reserve 10/10 ratings for \"works of art,\" but I just have so much fun watching this show and I think that it has been unfairly judged my many, that I just had to.", "assetId": null}, {"index": 88, "sample": "Actually, I have more a question, than a comment. I loved Z-Boys, and The Lords of Dogtown. Saw Lords first, then the doc, and while I loved the story, I am curious as to why in the movie, Sid was an important character, but in the documentary, he wasn't part of the team, and only merely mentioned as just some kid they knew. Does anyone know the story on that? The story of these boys was amazing. I never experienced the skateboarding craze where I grew up, but my kids have enjoyed it. What I have seen in local skate parks is what these boys had invented. I never knew that. When the film showed the competition, and Z-Boys did their thing, they put to shame the others in competition.", "assetId": null}, {"index": 186, "sample": "I would like to say that I absolutely loved Campfire Tales! To me, it was one of the original horror flicks with a twisted ending. As if the contents of the movie weren't scary or weird enough, you have the ending. It's a very awesome movie and I'm so happy that it's being released on DVD on August 30th.I will not hesitate to get my copy on that day.I don't think the movie received all the credit or recognition it should have, because all these other movies came out shortly after and was acknowledge, but if it weren't for my brother telling me about the movie, I wouldn't have known. Which stinks because in my opinion it's far better than any \"Scream\", \"I know what you did Last Summer\", or any other horror for that time. So I hope that you are able to see the movie yourself and at least be able to see the difference. I loved it, and being a horror movie junkie, Campfire Tales was like dessert for me!", "assetId": null}, {"index": 61, "sample": "I was lucky enough to see this film at a festival last year and had half expected it to get a release. The fact that it was shot on a digital camcorder has surely inhibited its success, but as i understand it was never the intention of the film maker to make it LOOK LIKE FILM in the first place, it was more about the story the characters and their relationships. Is that not what films are supposed to be about!? But it did have a quality in the texture of its visual appearance that suggests May Thomas is onto something we should pay attention to. For independent film makers and producers alike who have a the talent and lacking the money and drive, a lot can be learned from watching this film, technically it has everything going for it, the use of light, music etc by far outweigh that of any other digital feature film i have ever seen and therefore it is worthy of much praise. The actors performances are believable to a point, if not slightly under played, i felt there was much more in there, more depth, in particular from the male lead John Paul Clarke. But one thing that really does bother me, as a film maker myself, is the film being in black and white a need to cover up a multitude of sins than if it was colour? Do we have more to learn in the progression of digital technology? Or is this the future of wonderful, affordable film making?", "assetId": null}, {"index": 30, "sample": "It's funny because I read all the reviews on this page after getting this movie and it's either a love it or hate it reaction. You'll probably either love it or hate it too. I think the best films are the ones that divide people because obviously they have some kind of impact. I'm in the five star camp because this film did a real number on me and made me want to go back and find out more about Afghanistan and Iraq. I have to admit that I was pretty tuned out when all that was taking place. Especially Afghanistan and I feel guilty about that. The music through the movie was beautiful. I kept getting lost in it especially during some of the historical flashbacks. Personally, I thought the audio was great. It seemed to me that the soundtrack with speeches, music and the radio was put together so that you feel like you're in the RV with Jim, the main character, or in his head. Everything not on the radio was very clear and everything on the radio sounded like it was really on the radio. Anyway, this is a very amazing DVD which made me cry.", "assetId": null}], [{"index": 135, "sample": "I loved this film. A must see for any Rod Steiger fan. Producer Suzanne DeLaurentiis and Director Stewart Raffill have brought us a true family film that touches the soul. An incredibly well put together movie with a beautiful soundtrack.", "assetId": null}, {"index": 8, "sample": "Hysterically painful; perhaps the kind of movie Chekhov would have made had he made movies. What's really funny is that the two cousins have so very much in common (many descriptions of their relationship on this site are dead wrong).<br /><br />What's really funny and uncomfortable about these characters is that they just can't bring themselves to talk to each other - or anyone else! It's horrible. If you've ever been too shy, worried, self-involved, or just plain scared to talk to someone (and who hasn't?) you'll definitely see yourself in this film. And it won't be pretty.<br /><br />It holds a mirror up to the audience and says, \"If you don't like what you see... change it\".", "assetId": null}, {"index": 10, "sample": "I enjoyed the movie and Kellie Martins performance immensely. It's the kind of movie I can show my family and has an example of a young woman placed in extraordinary circumstances finding the courage to do the right thing in the face of extreme danger.", "assetId": null}, {"index": 22, "sample": "David Cronenberg movies are easily identifiable, or at least elements within the movie stand out as his trademarks. Fetishism, the blurring between the organic and inorganic, squishy throbbing things that shouldn't be squishy and throbbing. \"eXistenZ\" is classic Cronenberg. Briefly, it's about a future generation of computer games, but instead of a video monitor, visuals are supplied by your mind. The game plugs directly into a 'bio port' in the base of your spine and while the game is running, the player can't tell reality from game. Jennifer Jason Leigh plays the game's developer, guiding a novitiate marketeer, Jude Law, through the game's paces. While in the game they uncover strange goings-on and possible crimes. But are they real, or is it the game? Not even the game's author knows. <br /><br />The movie is quite a treat, keeping the viewer engaged, but in the dark until the final minutes. Another thing I like about \"eXistenZ\" is that it doesn't use a heavy reliance on special effects, it's the story itself that propels the movie. Recommended for the Saturday night when science fiction is called for.", "assetId": null}, {"index": 155, "sample": "This movie is an amazing comedy.. the script is too funny.. if u watch it more than once you will enjoy it more. Though the comedy at times is silly but it really makes u laugh!! Salman Khan and Aamir Khan have given justice to their roles. After 1994 i have not come across any hindi movie which was as funny as this.", "assetId": null}, {"index": 28, "sample": "(Very mild spoilers; a basic plot outline, no real details) <br /><br />IF you go into this movie with sufficiently low expectations. I saw this film at a free screening a few days ago in Maryland, and the only reason I agreed to go...was because it was free. I expected a few chuckles, but as I have never been a huge fan of Tenacious D, not much more then that.<br /><br />The first ten minutes of the film are hilarious, as we are given a look at Jack Black's humble Christian origins in a Midwest American town. The film then takes us years into the future, to the first meeting between JB and Kyle Gass, the second half of Tenacious D. We see the formation of the band and the genesis of its name. Finally, as the title suggests, the second half of the film details their quest to obtain the fabled \"Pick of Destiny.\" Again, the beginning of the film was laugh out loud funny, and most of the movie at least kept a smile on my face. That said, there were times it felt a bit long; it's only 100 minutes, but it still felt like it should have been a bit shorter. The story is every bit as absurd as it sounds, and this is not a film you see if you want a real plot. Which is fine, except it means that many of the jokes are very hit or miss...and when they miss, they miss bad. Same thing with the songs; it is a musical, but many of the songs lost their appeal after the first minute or so...then kept going anyway.<br /><br />I will say that the R-rating really saved this movie from bombing; The D's humor simply couldn't work without cussing, sex, and drug references. But unless you're a real fan of the band, or at the very least know you appreciate their style of comedy, I would recommend you save yourself some money and rent. \"Pick\" will make you giggle a bit...but is it worth 9 bucks? I don't think so. I was tempted to rate it a 6, but since I do think that many would enjoy it enough to justify seeing it in theatres, a 7 seems more appropriate. Just be sure it's your style.", "assetId": null}, {"index": 156, "sample": "It took a loan out film to Columbia for Gene Kelly's home studio MGM to realize his creative talent and give him some control over what he did in his own films. Cover Girl also became Rita Hayworth's signature film for the GIs and their pinup fantasies during World War II.<br /><br />Kelly plays the owner of a small nightclub in Brooklyn where Rita is a featured dancer and Phil Silvers the comic. Of course Kelly does a bit of hoofing himself there.<br /><br />Hayworth comes to the attention of millionaire Otto Kruger when it turns out that Kruger had loved and lost Hayworth's grandmother. In some flashback sequences from the gaslight era, Hayworth also plays her own grandmother with Jess Barker playing the young Kruger. You might remember Jess Barker was the husband of that other legendary screen redhead, Susan Hayward.<br /><br />Broadway producer Lee Bowman also is attracted to Hayward, but he's not interested in nostalgia. He wants her for his Ziegfeld Follies revue and in fact the biggest number of Cover Girl is the title song of the film. It's nicely done in Follies style.<br /><br />Hayworth also gets to sing A Sure Thing in a gaslight era number and in the only song in the show not written by Jerome Kern and Ira Gershwin, Hayworth also does an old English music hall number Poor John. When I say sing, as everyone knows Rita mouths words. Singing here is done by Nan Wynn.<br /><br />The biggest hit of the show is Long Ago and Far Away which is introduced by Gene Kelly. It was one of the biggest hits of the World War II era and one of the biggest sellers Jerome Kern ever wrote. It happens in fact to be a favorite of an aunt of mine who with my uncle will be celebrating 60 years of marriage this September. Long Ago and Far Away was nominated for Best Song, but lost to Swinging on a Star.<br /><br />What really sets Cover Girl apart and what makes it a milestone film for Gene Kelly is the two numbers Put Me to the Test and the Alter Ego number. Harry Cohn decided to do what Louis B. Mayer had refused at MGM, to give Kelly creative control of his own material. Kelly later said the alter ego number was one of the hardest things he ever attempted in his career. In it he dances with a pale reflection of himself and the choreography is dazzling and intricate. <br /><br />In fact after one more loan out film, Christmas Holiday at Universal, Louis B. Mayer never loaned out Gene Kelly for the rest of the time he was at MGM. And he did get creative control from then on.<br /><br />With that dazzling technicolor cinematography and Rita's red hair and Gene Kelly's boundless creativity, Cover Girl was and is a classic and will forever be so.", "assetId": null}, {"index": 31, "sample": "I saw this last night and voted it an \"8\". Since then, it's grown on me and I'd give it a \"9\".<br /><br />The film has (at first) a seemingly slightly disconnected facade between the first and second halves. The first half is a comedy and there's little hint of the ragged truths of eras, life, wars, religious intolerance that will become revealed in the second half. While at first it may be a little disconcerting because it's a slightly unfamiliar narrative sequence, on reflection it works.<br /><br />The acting was good (Hultz in the role of Alex, the interpreter, was especially great).<br /><br />I've scanned most other \"User Comments\" and see that some who've read the book are pleased with the movie while there are a few who are not. Both feelings, of course, are valid.<br /><br />For me, a retired family therapist and one-world believer, the film was relevant on two different levels.<br /><br />The first, as history, gave a powerful reminder of how commonly polarizations happen -- with demonizing and trying to exterminate any of those with a smidge different moral value system than our own. <br /><br />The second was that in demonstrating the first, it also revealed something in common to EACH of us, ALL our families -- that each of us must go back to our roots to more fully understand ourselves.<br /><br />T.S. Eliot expressed this exquisitely in the 4th of his \"Four Quartets\" when he said: -- \"We shall not cease from exploration// And the end of all our exploring// Will be to arrive where we started// And know the place for the first time.\" <br /><br />Jonathan goes on a fulfilling journey that any of us would find fantastically illuminating -- to explore and discover our roots; what were those people going through then, who were they -- really! -- before, when, and during the early years before and after we were born? Etc. <br /><br />So the film at first gives us the impression of a comedy, then shifts to give us a lesson in history and human deficiencies, but through all that it also gives us -- subliminally -- a message about each of ourselves. All of us would be abundantly rewarded to go back and understand the place from which we first started.", "assetId": null}, {"index": 170, "sample": "Simply put, there are two parts of this series that made me cry till my eyes fell out. First: The part where he was set to wash the toilet, but ended up drinking the toilet water while imagining it was the hot director giving him a golden shower!!! (I laughed so hard!)<br /><br />Second: The part where he tried to prove worthy of a swimming school instructor. He seemed like a pro diving in, but as expected, he couldn't swim (proper at least^^). However the funny part of this was when he finally reached the end and said \"how was that\" or something. That was so friggin hilarious, I couldn't stop laughing. <br /><br />If you get the chance to see this anime series, I strongly recommend it. One of the best I've seen. <br /><br />Definitely the funniest!", "assetId": null}, {"index": 174, "sample": "Serendipity. I thought I was off to a bad start, bringing home the wrong dvd in the case of \"The Intruder\". Rental stores' staff! So I did not want to see this film but I am glad I did. In all probablility my chosen movie would not have been as superb a slice film as this delectable and delicate taste of what independants in both US and Europe can do together. Seven years apart, two heroine sisters embark on fantastic journeys through early 1970's post-student demo / Baader-Meinhof Europe. Sumptuously shot in the Algarve, Portugal; and in Berlin, Paris, and Amsterdam (reminiscent of the feel of the exterior shots in Paul Verhoeven's early masterpiece, \"The Fourth Man\"), it's touchingly acted by Brewster , Diaz and especially Christopher Ecclestone.The story unveils itself along an abstracted plot, capturing the ephemeral emotions of these characters as they confront their relationships and see idealised images of each other and themselves shattered. A movie with great refinement and taste. Not for Arnie Commando fans, which is probably why the reviewer upstairs is so wide of the mark in 'his' claims that this is a girly film. Daft criteria. Wrong too. Well worth experimenting with.", "assetId": null}, {"index": 47, "sample": "Although little more than a pleasant 11-minute musical diversion (it's rightly billed as a \"Tabloid Musical\") EVERY Sunday is one of the most famous and precious documents in cinematic history, since it provides an invaluable look at the burgeoning talents of two of the screen's most talented and beloved musical performers: Deanna Durbin and Judy Garland.<br /><br />Although often cited as an screen test of sorts, produced by MGM to test the adolescent appeal of studio contractees Durbin and Garland whose options were reportedly coming up for renewal, this assertion is not entirely accurate. By the time EVERY Sunday was produced in July, 1936, Deanna Durbin's contract with MGM had already lapsed and she had been immediately signed by Universal a month earlier, in June 1936.<br /><br />However, a provision in Durbin's MGM contract permitted the studio to exercise an option on her services for up to sixty days, providing she had not yet begun work on a picture at her new studio. As Durbin's debut vehicle, THREE SMART GIRLS, was still not ready to begin filming, MGM chose to exercise its' option and, although officially under contract to Universal at the time, Durbin found herself back on the MGM lot filming this agreeable short subject with fellow adolescent singing hopeful, Judy Garland.<br /><br />This, along with Garland's far more extensive prior professional performing experience/training (which included appearances in several earlier movie shorts), may explain why EVERY Sunday often seems to favor Judy Garland over Deanna Durbin, giving Garland more lines to speak and an original song (\"Americana\") to sing, while Durbin offers the popular classical art song, \"Il Bacio\" by Luigi Ardiiti. Certainly, it would make perfect sense that MGM would want to favor one of its' own contract players over another from a rival studio.<br /><br />Ironically, although Garland's character is the more overtly pro-active one of the two girls in this short, it would be Durbin's feisty and impulsive \"Little Miss Fixit\" screen persona at Universal which would propel her to instantaneous worldwide super stardom as the world's first \"Teen Idol\" with her debut vehicle, THREE SMART GIRLS, while Garland's more passive \"wistful wallflower\" adolescent image would see her generally cast in supporting roles opposite frequent screen partner Mickey Rooney and (in ZIEGFELD GIRL) the up-and-coming Lana Turner. Not until her fifteenth MGM feature, 1942' FOR ME AND MY GAL (which was also her first fully \"adult\" role) would Garland achieve the solo above-the title billing and \"solo attraction\" status of a true superstar that Durbin had attained instantaneously six years earlier.<br /><br />It is entirely inaccurate, therefore, to assert that Garland was the only \"superstar\" attraction of the two girls, as Durbin attained this status with press 'n public, almost a decade before her MGM rival. Literally in foreclosure at the time of her signing, the on screen evidence strongly suggests that Universal was much quicker to realize Deanna's full superstar potential than MGM was with Judy, and it's worth noting that almost every notable accomplishment Garland achieved at MGM, from superstar billing, to having starring vehicles specially written to showcase her talents and appeal, to being invited to plant her footprints in the forecourt of Graumann's Chinese Theater, to receiving an \"Honorary\" Oscar\" in recognition for her talent, Deanna Durbin received well before her gifted MGM contemporary.<br /><br />In any case, EVERY Sunday is a delightful, utterly unpretentious musical short. Its plot line (Durbin and Garland use their singing talents to save Durbin's grandfather from being forcibly retired by the town council from conducting his Sunday concerts in the park), presages the plot lines of both Garland's \"Let's Put On a Show\" musicals with Mickey Rooney and Durbin's 100 MEN AND A GIRL. Unlike Garland's later BABES films, the short never treats the insubstantial storyline seriously, and consequently, its' eleven minute running time flies by.<br /><br />Of course, the true magic of EVERY Sunday is in observing the already remarkable performing talents/screen presences of Durbin and Garland at the very beginning of their legendary careers. Both girls, even at this early stage, possessed remarkable screen presences and are utterly natural and unaffected in their presentation as both singers and actresses. Garland fairly explodes off the screen with vitality as she literally punches out the lyrics to the jaunty \"Americana.\" As she socks across the number with appropriate hand gestures, Judy literally seems to be chewing on the words of the song as she screws up her mouth and bugs out her eyes in her intense eagerness to show what she can do.<br /><br />By contrast, Durbin's presentation of \"Il Bacio,\" is far more demure and subdued. Although entirely appropriate for her \"classical\" selection, Durbin's delivery of Arditi's waltz is much more of the traditional \"stand 'n sing\" variety than Garland's physically emotive turn. Nevertheless, though \"miniature diva\" Deanna does nothing to call attention to herself, with her candid eyes, dazzling smile and artless delivery, she easily holds the screen with \"jazz baby\" Judy, and their delightful duetting of \"Americana\" in the short's finale makes one regret all the more that producer Joe Pasternak was never able to realize his dream of pairing Durbin and Garland in a musical feature film (because Universal refused to loan \"Number One Asset\" Durbin out).<br /><br />A priceless document of the nascent talents of two remarkable and utterly unique talents. See this one if you get a chance!", "assetId": null}, {"index": 54, "sample": "We just saw this film previewed before release at the Norfolk (VA) Film Forum, and there was general agreement on two matters: There were excellent performances in a first rate drama by the two leads and by others: and secondly, the marketing for this movie will only bring disaster. We saw a lurid poster with chains and suggestive commentary implying some sort of wacko sexual relationship between Samuel Jackson and Cristina Ricci, whereas the movie has some real depth and some thoughtful ideas. What's sad is that people looking for near porn will be drawn in to see the film and will be disappointed because it will be too \"heavy\" for them, while the people who would really enjoy it wouldn't be caught dead walking into the theater showing it. Too bad. A good film wasted.", "assetId": null}, {"index": 184, "sample": "Billy and Jade had a very close relationship that went to far one evening even though Billy was sleeping with Jade's mother. Jade has to deal with the fact that her mother may never know and that it will never happen again. Billy is played by Rob Estes who couldn't have looked better. Lifetime tv has made another movie that everyone is bound to like.", "assetId": null}, {"index": 59, "sample": "I finally found a version of Persuasion that I like! Anne doesn't look like a scullery maid in this version, just a very thin, aging, pretty woman, quite like she's described in the book. Captain Wentworth doesn't look like he's 50, nor does he look perpetually angry but rather, as he's described in the book, he hasn't aged as much as Anne and is quite handsome. And they play their parts with such conviction and realism...that's what acting is all about. They were believable. They created real characters, and it was like the characters in the book came to life. If you haven't seen this version, I urge you to find it, order it or request it from either a bookstore, or a library if you must. It's worth the price and worth the wait. <br /><br />I watched the 1995 version, and the 2007 version and this one towers over the other two. Why it isn't rated higher is beyond my comprehension. The book conveys the tenderness of their relationship and this movie makes the book come to life.", "assetId": null}, {"index": 64, "sample": "This film is absolute gold. If you haven't seen it, do. Mani Ratnam outdoes himself once again. This film introduced me to Nandita Das as well, though everyone shines in this movie. My only regret is I've never found a copy with subtitles to the lyrics of the songs. We are led from the jungle of northern Sri Lanka to the serene beaches of Southern India, as well as from the terror of war to the ultimate conquest by love of the human heart. Beautiful, subtle, witty, with a few hidden surprises waiting for the viewer, this movie stands up to being seen again and again, and the story within the story, The Umbrella, is done so well, as we watch the scene unfold from drawings in a book. Lovely. Watch it.", "assetId": null}, {"index": 194, "sample": "While researching Susan Harrison (The Ballerina) in reference to a Bonanza Episode, I was reminded of this gem.<br /><br />This episode is the inspiration for Dylan's \"All Along the Watch Tower\" (Hendrix's cover is probably as well know and is one of his best) which is one of HIS best.<br /><br />Thus this episode is responsible for several 'bests' - not bad for approximately 22 minutes of television.<br /><br />But this is \"The Twilight Zone\". Further comment of the series is unnecessary.<br /><br />'5 Characters' is typical Serling. Intense, dramatic, barreling toward an end that is as inevitable in hindsight as it is surprising the first time you see it.<br /><br />This episode is spoiled in one sentence and is too good to spoil for any who have not seen it.<br /><br />But you will feel ambushed. And you will never listen to Hendrix with the same ears again.", "assetId": null}, {"index": 195, "sample": "This is one of the best martial art(Kung-fu) movies of all time. if u love martial art movies this is a not to miss. From flying nuns to training monks this movie has top kungfu styles and a good story line. Its about a priest from the wu dang clan trying to eliminate all the shaoulin fighters to be claim the title of being the best in martial arts. after killing key members of the shaoulin temple the faith of the shoulin is remained in the hand of two boys secretly training under a shaoulin monk. The white abbot or the priest from the wu dang clan develops new techniques that turn him into iron. well this a not to miss classic. It involves Ninjas, shaoulin and nuns fighters. it a great classic", "assetId": null}, {"index": 71, "sample": "I kid you not. Yes, \"Who's That Girl\" has the distinction for being one in a string of Madonna's films that bombed, but I actually liked this movie more than \"Desperately Seeking Susan\". In \"Susan\", Madonna's character is relegated to being second-fiddle to Rosanna Arquette and is not given much to work with. No disrespect to Rosanna, but in WTG Madonna plays this zany, outrageous character, only done in an 80s style. While it may seem \"cheesy\" today, this is actually one of Madonna's best and one of her most underrated films.<br /><br />Madonna plays Nikki Finn, an ex-con who is sent to the slammer for a crime she didn't commit. She's being released from jail after four years of good behavior. Griffin Dunne, who is also a very underrated actor, plays Louden Trott, a lawyer who has the unpleasant task of picking her up from jail to take her to the bus station. Of course, when these two get together, that's when the madness happens. Sir John Mills has a small role as the rich businessman who has a huge mansion in the middle of Manhattan with a rainforest(???) on his roof. <br /><br />This movie parodies everything. Rich people, the sleazy characters who live in Harlem and totally destroy Louden's Rolls-Royce, the gay cops who follow Madonna and Dunne around town, and Dunne's stuck-up fiance Wendy Worthington who has purportedly slept with every cab driver in New York City (played by Haviland Morris, who was Jake's girlfriend Caroline in Sixteen Candles). Hilarious! Plus, Dunne is also in charge of a rare breed of leopard reminiscent of \"Bringing Up Baby\". Plus, Madonna had a great platinum blonde 80s look back in those days and the movie has a great soundtrack. Throw this all into the mix and you have the zaniness of WTG.<br /><br />Madonna is the queen of deadpan acting. There are times in the movie where she says a line totally straight and surprisingly, it turns out to be funny! That's how some of the best comedy should be played - straight. Madonna should have done more comedy and it was a shame that she did not choose to do so. Later on she became much more controversial and got into more of the dark, sexually-charged roles in the notorious movies \"Body of Evidence\" and \"Dangerous Game\". <br /><br />Some people say Madonna cannot act, and that is fine, people are entitled to their opinion, but I believe the real problem is that people cannot see the difference between Madonna playing a character on film, instead they still see only Madonna and that is main reason why she is given more respect for her music than for her movies. It's still a fun, screwball comedy of the 80s. Not for everyone, I'm sure some of you will dislike it, so I would recommend it mainly for Madonna fans, but you never know, you might be surprised and like it! <br /><br />Interesting note: One of Madonna's friends from her early-80s New York club days, Coati Mundi, who plays Raoul, was a member in the bands Kid Creole and The Coconuts and Savannah Band.", "assetId": null}, {"index": 72, "sample": "Another of the endless amount of cookie-cutter 'Kickboxers Fight to the Death for the Amusement of Wealthy Scumbags' films that there were so many of in the 90s... Y'know, the ones created by taking the words 'Death', 'Blood' and 'Steel' and the words 'Ring', 'Fight', 'Match' and 'Cage' and putting them in a random generator! Saying that though, Death Match is a pretty good entry in the over-used genre, thanks to its exciting fight scenes and the surprisingly good acting of its kickboxer cast.<br /><br />The story concerns two buddies - ex-Kickboxing World Champion John Larson (played by pug-faced Middleweight Kickboxing Champ Ian Jacklin, probably previously best known for his awful performance as the main villain in Ring of Fire 2) and Nick Wallace (Nick Hill, a likable guy probably best known for the role of street-fighter Sergio in Bloodsport 2) who work the L.A. docks loading crates onto ships. One discovery of a boxful of guns and a brief fight later, our two heroes are jobless and propping up an L.A. bar. Sensible John Larson decides to head North and look for a job; headstrong Nick Wallace has heard of a guy paying good money for fighters to fight in private kickboxing matches. \"Why should things change?\" says John, \" If you need me, i'll be there.\" Predictably enough, it isn't long before Nick has gone missing and his good friend is fighting in the deadly 'ring of death' trying to find a lead to his missing buddy.<br /><br />Sure enough, there are no prizes for originality here, but like i said before, this films strength lies in its action, its cast of real-life fighters and the fairly good performances it manages to wring from them. Ian Jacklin in particular surprised me. Previously i'd just seen him as the bad guy in Ring of Fire 2 and in bit-parts in tripe like The Steel Ring, and i've always been quite amused at how bad an actor he is (good fighter though!). But in Death Match, he's pretty good! Given a decent script and a haircut, he proves himself to be quite the charismatic leading man! And his friendship with Nick is very well portrayed. Jacklin and Hill have a nice chemistry and you really believe these two characters care for each other. Enough for one of them to lose a job, travel halfway across the country and risk death to save the other - I wish i had a friend like that! <br /><br />It was also nice to see Matthias Hues as a villainous henchman with a little more depth than we're used to seeing from his many 'villainous henchman' roles. However don't be fooled into thinking he's the star just because he's on the video cover (with, it seems, his head stuck on the body of Michael Bernardo from the cover of Shootfighter) - he is good while he's on screen, but he isn't on much..<br /><br />On the negative side, the film is pretty slow when there's no fighting going on, with lots of unnecessary scenes (whats with gangster Jimmie Fiorello's pointless story about his grandfather??), and the end fight is disappointingly short, but on the whole i enjoyed it! Plenty of fights, most of them good. Isn't that all we martial arts really need? And of course eye-candy, here in the lovely form of the very pretty Renee Ammann. All in all, a pretty entertaining kickboxing movie.", "assetId": null}, {"index": 83, "sample": "If you think about it, it's nearly unbelievable that a film could be made about the death penalty (one of the world's most controversial topics) that offends neither those for nor against. It's a testament to Tim Robbins' extraordinary intelligence and sensitivity, traits that can be seen in his acting roles as well (Shawshank Redemption, Jacob's Ladder).<br /><br />This film in fact hints at a subtle compromise between the \"for\" and \"against\" camps... so subtle that it can't be put into words, subtle to the point of vanishing, yet one gets the sense after watching the picture that a compromise is possible, that somehow it can be worked out if only we look deeply enough...", "assetId": null}, {"index": 92, "sample": "An Arab American man is kidnapped from an American Airport and flown to \"somewhere in North Africa\" where he is tortured. The reason? His cell phone received a call from a known terrorist. The CIA decides to avoid legal means to determine whether the phone call is implication of guilt or just a mistake. After watching this movie we can only but pray some terrorist doesn't accidentally punch in a wrong number!<br /><br />In addition to the rendition there are several related side stories. One involves the daughter of the chief of intel (secret police?) who is torturing the suspect, and her involvement with her lover who happens to be in night school for suicide bombers. This story is way too contrived, but nevertheless intriguing, especially when we see it's outcome. The Director uses a neat time line switcheroo to hook the audience. <br /><br />The second side story is the attempt by the suspects wife to find out what happened to her missing husband. She gets an old lover to help. He (a muted Saarsgard) is aide de camp to a Senator (Alda) and soon gets cold feet when he realizes that his job isn't worth uncovering the truth. Witherspoon is wasted in this role. All she gets to do is look forlorn and pregnant, with one brief rage attack. Streep is good and cold and stereotypical as the govt. (CIA?NSA?Homeland Sec?) official who seems to be a Cheney clone. <br /><br />Gylenhall also is wasted as a minor analyst pushed into in area he's over his head in, although he gets to do the \"right thing\" in the end.<br /><br />I found the movie engrossing, if somewhat languorous, but thought it added little to the subject. It is certainly not to be viewed as definitive, and it certainly has an axe to grind. Like \"The Kingdom\" it scratches the surface of a very complicated subject.<br /><br />The movie tries hard to give us an idea about rendition, but can only end up by being a \"cautionary tale\" about one botched one. The whole point of rendition is not to \"torture\" but to get \"terror suspects\" to give intel by avoiding legal (therefore obstructive) barriers. Torture, for sure, may be employed, especially if the rendition is out of our hands - although we are obviously not guiltless in this matter - but intel that can save lives is vital in this \"shadow war.\"", "assetId": null}, {"index": 93, "sample": "\"The Man Who Knew Too Much\" (1955) is Alfred Hitchcock's own remake of his 1934 thriller about a married couple (James Stewart and Doris Day) on vacation in Morocco where they got caught up in a nightmare that include murder, espionage, assassinations and the worst of all, kidnapping of their 10-years-old son. The movie which Hitchcock himself considered superior to the original is a great fun. Stewart and Day have a good chemistry together. The film is filled with the wonderful comical scenes and dialogues as well as the scenes of chilling suspense. <br /><br />The inclusion of \"Que Sera, Sera\" proved to be a stroke of genius because rarely the song fits the content and plays such an important role in the movie like \"Que Sera, Sera\" did in \"The Man Who Knew Too Much\". <br /><br />Hitchcock also treats us to the live music playing from Arthur Benjamin \"Storm Cloud Cantata\" for almost ten minutes while scene in London's Royal Albert Hall where the assassination of a very important politician was attempted takes place and both, the scene and the cantata are simply marvelous.", "assetId": null}, {"index": 107, "sample": "The folks at Aardman have done a cool, cute and wild adaptation of their short films of Wallace and Gromit to feature length, as the man and his dog, inventors who seem to have more of the intelligence (or practicality) for the latter. In this case they've invented a machine that can capture all of the bunnies that are eating up the crops all over a quiet English village. In particular for Mrs. Tottington (or 'Totty' for those who are 'intimate'), much to the chagrin of Victor Quartermaine, who just wants to kill all the rabbits with his trust rifle. Wallace and Gromit seem to have success with their machine, but Wallace has a mix-up: a machine he's made to make more food suddenly criss-crosses himself with a rabbit - the curse is on! <br /><br />A lot of this is about as much light-hearted fun that a kid's movie could ask for, but it also tips its hat to the oldest tradition in classic cartoon slapstick: Looney Tunes, which in turn is indebted to much silent comedy and vaudeville. Granted, the Aardman guys (Nick Park and Steve Box) have a bunch more gimmicks and tricks and ingenuity with their material. It's never less than amazing to see how they put the stop motion to use, even when a joke or a gag might be a little on the funny \"ho-ho\" not funny \"ha-ha\" side (a tired criticism but I'll say it). Curse of the Were-Rabbit works so well on all fronts for the audience, in its warped story and sudden dips into exposition (the Golden Bullet story is a doozy), Park and Box and company never lose sight of glee in the material.<br /><br />It's fuzzy and warm-hearted and completely off-the-wall for the kids (even the very youngest will love the adventures and strange gadgets, such as the truck Wallace and Gromit drive around in), and for adults there's little barbs of funky, absurdist tones in the midst of a classic English farce. Only (and I'm probably a minority opinion here) when compared to Chicken Run it's almost a little slight a work- there's less any plot than there is a series of running gags, and of course lots of puns involving bunnies and monsters and carnivals and cheese (and horrible men with egos in their guns like the Fiennes voiced Quartermaine). But when it strikes best, it's one of the most entertaining films of 2005. It gives me a big goofy smile anytime it's on TV.", "assetId": null}, {"index": 114, "sample": "AAA is my favorite movie... I have seen it a number of times (don't remember the count now) and every time I just love it.... This is the best movie of Raj Kumar Santoshi..The comedy, dialogues, and performance is amazing.. All the actors and actresses have done a superb job... You cannot stop laughing while watching this movie... its just hilarious... Amir khan and Salman Khan have done a great job... and acting by Paresh Rawal was excellent as always..... The music is inspired from the old Hindi movies (60s music) and is good...the entire cast of the movie has done great job... <br /><br />Overall its a great Indian comedy movie to watch...", "assetId": null}, {"index": 116, "sample": "One of the two Best Films of the year. A well filmed, well written, well put together film with an outstanding cast. Lau Ching Wan and his friends (Dayo Wong Chi Wa, Anthony Wong Chau Sun, Francis Ng Chun Yu, Jordan Chan Siu Chun, Cheung Man Tat) had great chemistry before the film and their friendship shows in their performances. Theresa Lee plays her comedic role well (Though much like a female version of Michael Wong, her gag seems to be the foreign born Chinese surrounded by native HKers.), and I found myself cheering for innovative explosive scenes, something I haven't done since 1. the fan boys took over alt.asian-movies and 2. John woo's Hardboiled. Sure the ending was expected, but I feel better cheering for cops than a bunch of young gang members. Highly enjoyable.", "assetId": null}]]], "type": "string"}